{
  "A A! or Eh-Eh!": [
    "Is an exclamation. When you didn't expect something. Usually used like, \"Well, excuse me!\" For example: \"But, A A!\" or \"Eh Eh!...Is you here?\"."
  ],
  "Aajaa": ["Paternal grandfather [from Bhojpuri Hindustani]."],
  "Aaji": ["Paternal grandmother [from Bhojpuri Hindustani]."],
  "Aatkapaari": ["Headache/migraine [from Bhojpuri Hindustani]."],
  "Abbatoir": ["(Pronounced 'Abatwa') an animal slaughter house."],
  "Abu": ["Father [Bhojpuri Urdu]."],
  "Achar or Anchar": ["Mango pickle."],
  "Ah go do fuh yuh": ["A threat of revenge or retaliation."],
  "Ah want tuh hail out": ["I would like to \"shout out/big up\"."],
  "Akimbo": [
    "A standing body posture with one leg straight while the other is bent and either one or both hands on the hip."
  ],
  "Allah": [
    "God in general and more specific God in Islam [from Bhojpuri Urdu, Persian, and Arabic]."
  ],
  "All-fours": ["A card game."],
  "Allyuh": ["You all.", "All of you people."],
  "Aloo": ["Potato [from Bhojpuri Hindustani]."],
  "Ami": ["Mother [Bhojpuri Urdu]."],
  "Ass buss": [
    "Means you are in over your head or you have failed. E.g. \"Yuh ass buss!\"."
  ],
  "Ay or Aye": ["Means either hey, or you."],
  "Awa": [
    "Literally means \"or what\", but its usage is to make Trinidadian slang flow better. For example, \"yuh wastin' muh time, awa?\" , literally meaning \"are you wasting my time?\"."
  ],
  "Babaash": ["Bootleg rum, i.e., moonshine made from fruits."],
  "Bachak": ["Very large species of ants."],
  "Baaboo": ["Term for a ghost or a spirit, normally used to scare children."],
  "Back-back": ["To move backwards or in reverse direction."],
  "Bacchanal": [
    "Commotion, a wild party, a fight between neighbours, family or friends. E.g. The wedding reception was 'real' bacchanal 'cause of the difference in religions between the bride and groom.",
    "A Latin word meaning 'drinking a lot' named after the Greek and Roman God of wine called Bacchus. It is a revelery considered obscene.",
    "Scandal, heavy quarreling, big party, confusion."
  ],
  "Bad": [
    "A description of something that is extremely good. It can also be used to describe a sexually promiscuous female (see baddist)."
  ],
  "Badjohn/Baa-John": ["A bully."],
  "Baddist/Bad ting": [
    "An extremely promiscuous female. in recent times, it has been used for men as well, but in a less serious sense."
  ],
  "Bahu": ["Daughter-in-law [from Bhojpuri Hindustani]."],
  "Baigan": ["Eggplant [from Bhojpuri Hindustani]."],
  "Baiganee": ["Fried doughy snack made with baigan or eggplant."],
  "Bake": [
    "The name of several kinds of unleavened breads that are either baked (E.g. Coconut Bake) or fried (E.g. Fry Bake)."
  ],
  "Balata": [
    "Locally grown small fruit with leathery skin and sweet juicy pulp."
  ],
  "Balisier": [
    "A species of Heliconia (flower) used a symbol to represent the political party, P.N.M."
  ],
  "Bambam": ["Buttocks."],
  "Bamsee or Boomsee": ["Buttocks."],
  "Bambozzle": ["To make some one confused."],
  "Bandhaniya": [
    "Eryngium foetidum, an aromatic herb used as a spice (also known as Shado beni or Chadon benit). [from Bhojpuri Hindustani]."
  ],
  "Banga": ["A species of palm fruit."],
  "Barbadeen": [
    "Also known as the giant Granadilla fruit or the milk based beverage made from it."
  ],
  "Barfee or Barfi": [
    "(Food) Light colored dairy based sweet of Indian origin."
  ],
  "Barra": [
    "A deep fried saffron coloured bread (see doubles) [from Bhojpuri Hindustani]."
  ],
  "Batty": ["Buttocks."],
  "Batty-manzel": ["Dragonfly (Insect)."],
  "Baylena": ["Rolling pin."],
  "Bazodee": [
    "Light-headed or in shock or crazy.",
    "A state of dizziness or confusion, typically caused by members of the opposite sex."
  ],
  "BeeWee": [
    "BWIA West Indies Airways, the former national airline of Trinidad and Tobago. The acronym for British West Indian Airlines is often colloquially referred to as Better Wait In Airport, Big Wait In Airport, Better Walk If Able, But Will It Arrive, Bankrupt West Indian Airlines, etc.",
    "BWIA, British West Indian Airways, the national airline of Trinidad & Tobago.",
    "(BWIA) British West Indian Airways, the national airline of Trinidad and Tobago now Caribbean Airlines (since Jan 1st,2007) after 66 years in the air as BWEE with a flawless accident record."
  ],
  "Behen": ["Sister in general or smaller sister [from Bhojpuri Hindustani]."],
  "Behyne-Gawd-Back": [
    "A very distant and obscure place or location (derived from 'Behind God's Back')."
  ],
  "Beta or Bituwa": ["Son [from Bhojpuri Hindustani]."],
  "Beti or Bitiya": ["Daughter [from Bhojpuri Hindustani]."],
  "Bhagwan": ["God in Hindu religion [from Bhojpuri Hindustani]]."],
  "Bhaiya or Bhai": ["Brother [from Bhojpuri Hindustani]."],
  "Bhaji": [
    "Various green leafy vegetables (especially amaranth or dasheen). [from Bhojpuri Hindustani]."
  ],
  "Bhauji": ["Sister-in-law (brother's wife) [from Bhojpuri Hindustani]."],
  "Bingo Bags": [
    "A large pair of female underwear, usually found worn on Elder women (70 and above). Also referred to as \"Granny Panties\"."
  ],
  "Blasted": [
    "Used to emphasise other words (for example, \"gih mih de blasted ting nah!\" [\"give me the damn thing please\"]) when one is irritated. It is used in a more vulgar sense, though is more acceptable than direct foul language. Similar words are blinkin, stinkin, friggin and flickin."
  ],
  "Blight": ["Cursed, bad omen or bad luck."],
  "Blinkin": [
    "Used to emphasise other words (for example, \"gih mih de blinkin ting nah!\" [\"give me the damn thing please\"]) when one is irritated. It is used in a more vulgar sense, though is more acceptable than direct foul language. Similar words are stinkin, blasted, friggin and flickin."
  ],
  "Bobbol": [
    "Illegal activity, usually in the context of corporate criminality, white-collar crime or political corruption."
  ],
  "Bobolee": [
    "A figure of Judas beaten at easter or a stupid person.",
    "A person who is habitually taken advantage of.",
    "A stupid person."
  ],
  "Bodi": ["Pole beans [from Bhojpuri Hindi]."],
  "Boesee-back": ["Hunched back."],
  "Bol' face": [
    "A brazen or demanding person, a person who speaks or acts using indiscretion."
  ],
  "Booboolups": [
    "Overweight or out of shape. Can also be used to romantically or sarcastically describe affection for an overweight female."
  ],
  "Bois": [
    "(pronounced \"Bwah\") 1. A big heavy stick (or 2x4), used for harming others. 2. To beat someone badly. Eg. \"Move, boy or I go give yuh bois.\"."
  ],
  "Bone": [
    "To have sexual intercourse. May also refer to the male genitals. (Contrast though with the phrase \"Trini to de Bone!\")."
  ],
  "Bonx": [
    "To hit or slam, commonly referring to car accidents (He bonx she car). Also used to indicate a type of greeting where the participants (usu. male) gently touch each other's closed fists. Derived from the word \"Bounce.\"."
  ],
  "Boof": [
    "To rough someone up or insult them or to scold someone. Can also be used to refer to the person who was roughed up or insulted (derived from \"buff\"). E.g. Sarah boofed Brian for leaving without her. Brian 'get' boof up for leaving without Sarah. (Alt spelling \"bouff\").",
    "To insult, castigate, yell at or argue with."
  ],
  "Boomboom": ["Buttocks."],
  "Break": ["Ejaculation of the penis or the semen itself."],
  "Break Biche": [
    "To leave or shirk one's duties in favour of liming, usu. in the context of secondary school or work. E.g. Brian & Ricardo break biche to go to the Arcade."
  ],
  "Breathel/Furr Mouth": ["Halitosis."],
  "Bredda": ["Brother.", "Slang for 'brother' or 'Breddren'."],
  "Breds": ["Brethren."],
  "Broughtupcy": ["Manners, upbringing."],
  "Buljol": [
    "Dish made from Salted Fish or 'Sawlfish'. Similar to Portuguese 'Baccalao'.",
    "A meal made of shredded saltfish, onions, tomatoes, pepper and olive oil."
  ],
  "Bun": ["Burn or burned.", "Trini pronunciation Burn."],
  "Bungry": ["Boundary."],
  "Bull": [
    "To have sex (whether heterosexual or homosexual in nature).",
    "Another word for sexual intercourse."
  ],
  "Buller": [
    "One who bulls, but usually in the context of, or suggesting, a homosexual act (see Bullerman) (derogatory)."
  ],
  "Bullerman": ["One who engages in homosexual activity."],
  "Buss": [
    "Burst.",
    "To burst; to be a flop e.g. 'Dred, dat party rel buss.'."
  ],
  "Buss it!": ["Command to move away quickly. Similar to 'Beat it!'."],
  "Buss up": ["Breakdown of a relationship."],
  "Buss out": ["A disagreement or falling out in a relationship."],
  "Buss-up-shot": ["A type of flat bread also known as Paratha."],
  "Buss yuh ass": ["A threat to beat someone."],
  "Button": ["Pimples or acne."],
  "Caca": ["Feces."],
  "Caca-hole": ["The anus or an offensive term for a rude or ignorant person."],
  "Caimate": [
    "Locally grown round or ovoid shaped fruit which contains a sweet edible pulp. May range from green-skinned to dark purple in color."
  ],
  "Callaloo": [
    "A dark green soup-like dish with a very thick consistency traditionally made with dasheen leaves, ochro, coconut milk and bits of meat and/or crab.",
    "A dish (sort of broil/soup) made from leaves of the dasheen bush, okra, coconut milk, seasonings crab and salt meat or crab. It is like spinach.",
    "A thick soup made from dasheen leaves, ochroes,coconut milk, seasoned to taste, invariably includes crab."
  ],
  "Carite": [
    "(Pronounced 'Careet') is a large species of salt-water food fish."
  ],
  "Carripulay leaf": ["Leaf of the curry plant or curry tree."],
  "Carraillee or Carrailli": ["Bittermelon (Vegetable)."],
  "Cascadoo": [
    "A small species of fish in the catfish family that is normally prepared as a curry dish."
  ],
  "Cattle boil": [
    "(Pronounced 'Kyattle boil') is a medical condition with a boil or swelling within the eyelids."
  ],
  "Cerise": [
    "(Pronounced 'Series') is a species of small fruit that is dark red in color and is to be lightly massaged until soft before consuming the seedy pulp inside."
  ],
  "Chaamar": [
    "The lowest caste of the Hindu caste system equivalent to a Dalit. Since the abolishment of the caste system by Hindus in Trinidad and Tobago, it's used to insult Hindu Indians as a racial slur sometimes [from Bhojpuri Hindi]."
  ],
  "Chaana": ["Chickpeas."],
  "Chacha or Khakha": ["Father's smaller brother [from Bhojpuri Hindustani]."],
  "Chachi or Khakhi": [
    "Father's smaller brother wife [from Bhojpuri Hindustani]."
  ],
  "Chadon Beni": [
    "(Pronounced 'Shadow Benny') an aromatic herb used as a cooking spice. Also known as Bandhaniya or Culantro. Eryngium foetidum (Scientific name)."
  ],
  "Chainee": [
    "A sometimes offensive term used to refer to a Chinese person or someone with East Asian facial features. Also spelled 'Chinee'."
  ],
  "Chakai": ["Engagement ceremony."],
  "Chalta": ["Species of large fruit used to make pickles or preserves."],
  "Chaser": [
    "A non-alcoholic drink that is mixed with liquor before consuming together."
  ],
  "Chathi": [
    "Hindu ceremony held on the evening of the sixth day of after a child's birth."
  ],
  "Chataigne": [
    "(Pronounced 'Shataign' and also known as 'Breadnut') is a tree species grown for its large fruit which is utilized in its immature stage as a vegetable and the cooked seeds of the mature stage consumed as a snack. Both plant and fruit referred to as Chataigne."
  ],
  "Chauki": ["A board used for rolling out roti [from Bhojpuri Hindustani]."],
  "Chautal": [
    "A type of folk music from the Purvanchal region of northern India sung during the spring time especially for the festival of Phagwah or Holi [from Bhojpuri Hindi]."
  ],
  "Cheeni": ["Sugar [from Bhojpuri Hindustani]."],
  "Chela": ["Follower or disciple of a Hindu pundit or guru."],
  "Chenet": [
    "The fruit of Melicoccus bijugatus tropical American tree having small fragrant greenish-white flowers and small fruits with a green leathery rind and a juicy pinkish translucent pulp."
  ],
  "Chickee-Chong": [
    "A type of low flying kite whose structure is made entirely of paper with simple construction and a low degree of flying capability."
  ],
  "Chyle or Chile": ["Child (pron. \"ch-isle\")."],
  "Chilli-bibbi": ["Snack made with finely ground corn and sugar."],
  "Ching-gum": ["Chewing gum."],
  "Chinkey/choonkey": ["Small."],
  "Chin-nee": ["Caterpillar."],
  "Chip": ["A walking shuffle step done to slower soca tunes."],
  "Chip-Chip": [
    "A small species of bivalve mollusks that inhabits the sandy seashore."
  ],
  "Chirren": ["Children."],
  "Chhinar": ["Prostitute, slut, or whore [from Bhojpuri Hindustani]."],
  "Chhowra": ["Village boy [from Bhojpuri Hindustani]."],
  "Chhowri": ["Village girl [from Bhojpuri Hindustani]."],
  "Chokha": [
    "A dish made of a roasted vegetable like baigan or damadol [from Bhojpuri Hindustani]."
  ],
  "Chook": [
    "To pierce (or jook), usu. in reference to needles. Can also refer to dancing which involves the thrusting of one's hips forward sharply into the rear of another. May also refer to sexual intercourse. E.g. Riad took a little chook from the girl."
  ],
  "Choolha or Chulha": [
    "(AKA 'Fire-side') a small enclosed structure traditionally made out of clay and/or mud, used for supporting a cooking vessel whilst holding a wood burning fire."
  ],
  "Chotka": ["Husband younger brother."],
  "Christophine": [
    "(pronounced 'Kristofeen') a edible vegetable in the gourd family also known as Chayote."
  ],
  "Chupid": ["Stupid.", "Stupid, foolish.", "Stupid."],
  "Chutney": [
    "Spicy condiment or Indo-Caribbean music genre.",
    "A puree spicy sauce from India and used in Tribago by descendants of India.",
    "A spicy East Indian condiment made from half-ripe mangoes, tamarind, coconut, cucumbers usually in the form of a sauce.",
    "A type of music indigenous to Trinidad, which evolved from Indian music, a catchy and rhythmic East Indian fete music conducive to wining (see wining) your bamsee (see bamsee)."
  ],
  "Cock-up": [
    "To lay down or position your body with feet off the ground in a very relaxed posture."
  ],
  "Coco": ["The penis."],
  "Cocoa payol": [
    "A person of mixed racial ancestry with a 'brown complexion' of Latin American and Spanish origin."
  ],
  "Cocoa tea": ["A hot beverage made with locally produced cocoa sticks."],
  "Coekey-eye": ["Cross eyed."],
  "Coolie": ["A derogatory term for a person on Indian origin."],
  "Coonu-moonu or Cunumunu": [
    "An offensive term for a person who is thought to be backward, simple-minded, unintelligent, easily fooled or socially awkward."
  ],
  "Corbeaux": ["(Pronounced 'Cobo') a black vulture."],
  "Coscarub": ["Fresh water species of fish sometimes used a a food fish."],
  "Coskel": ["Overdressed; also cosquelle."],
  "Creole": ["A person of mixed ancestry but with primarily African."],
  "Crix": ["A type a round cracker (food) or non-sweet biscuit."],
  "Cro-Cro": ["The name of a salt-water food fish."],
  "Curry-Q or Curry-Que": [
    "The sale or a showcase of food that includes curry dishes."
  ],
  "Cut-ass": ["A physical beating."],
  "Cutlaash": ["A machete or cutlass."],
  "Cut a night": [
    "Spend a night away from your home, e.g. \"I hear Lesmond went by he girl place, fell sleep and cut a night; he ga get planass for dat!\"."
  ],
  "Cunt": ["Vagina. Also a derogatory term."],
  "Cuz": ["Because."],
  "Cyah": ["Can't."],
  "Cyat": [
    "A somewhat derogative term reserved usually for a woman that is perceived to have unattractive character traits. This word is derived from the colloquial meaning of a \"cat\" or \"pussy\" representing a vagina. The woman, or sometimes the man, who is deemed a cyat is thought to be ignorant of their actions and behaving in an unrealistic manner. One such example is: \"Gosh, that woman behaving like a cyat eh!\"."
  ],
  "Dada": ["Father's older brother [from Bhojpuri Hindustani]."],
  "Dadi": ["Father's older brother wife [from Bhojpuri Hindustani]."],
  "Dahee or Dahi": ["Yogurt, especially traditionally made."],
  "Dal": [
    "Ground up split peas [from Bhojpui Hindustani] (Dal Bhat is ground split peas with rice)."
  ],
  "Dal gootnee or gutni": ["A wooden utensil used in making dal."],
  "Dalpuri": [
    "A type of roti with ground up split peas inside [from Bhojpuri Hindustani]."
  ],
  "Damdol": ["Tomato."],
  "Dan": [
    "A word similar to the American slang usage of \"man\", and can be used to speak to a friend or to a random person. Usually only used for men."
  ],
  "Dat": ["That.", "That."],
  "Daz": ["That's/ that is."],
  "De": ["The."],
  "Deeray or Dhiray": ["Slow (from Hindustani)."],
  "Deewali": ["Hindu festival of lights."],
  "Devar": ["Husband's younger brother [from Bhojpuri Hindustani]."],
  "Devrani": ["Husband's younger brother's wife [from Bhojpuri Hindustani]."],
  "Dey": ["There."],
  "Didi": ["Older sister [from Bhojpuri Hindustani]."],
  "Dimanche gras": [
    "(Pronounced 'Deemash Gra') Sunday celebrations before the two days of Carnival."
  ],
  "Dingolay": [
    "Dance wildly.",
    "A word used by early Calypsonians and particularly Kitch. It is a dance but a special dance with erotic and sensuous overtones. It is a wine with sexual suggestiveness. It is a tease. It is used by women who flirt and men who respond.",
    "To dance in a joyful, carefree manner."
  ],
  "Dhaniya": ["Coriandrum sativum [from Bhojpuri Hindustani]."],
  "Dhantal": [
    "Instrument made during the days of Indian indenturship [from Bhojpuri Hindustani].",
    "Traditional Indian instrument kind of \"sounding metal tubes\", to hear in Chutney Socas."
  ],
  "Dhoti": [
    "The traditional white cloth wrapped around the waist of an Indian man [from Bhojpuri Hindi]."
  ],
  "Dong": [
    "Down E.g. 'Dong dey' means 'Down there', 'Dongtong' means 'Downtown'.",
    "Down.",
    "Trini pronunciation Down."
  ],
  "Donkey": ["Card game."],
  "Dose": ["Friend (From Hindustani 'Dost')."],
  "Dotish": [
    "(doltish) stupid.",
    "Silly, stupid, foolish and dumb.",
    "Stupid; slow-thinking;incompetent.\nDotish men like you deserve what you get.  If you can't work things out with your own woman, then stop complaining.  Sorf -soft- men like you should simply do as you are told.",
    "Silly, stupid, foolish and dumb."
  ],
  "Doubles": [
    "A sandwich of sorts made with a saffron coloured bread and curried chick pea filling. There is no singular form of the word.",
    "Curried channa served between two pieces of fried bread.",
    "A popular East Indian fast food made from curried chickpeas and bara (fried dough) Usually served with chutney on top."
  ],
  "Douen": [
    "A mythological dwarf forest dweller with legs pointed backwards who deviously entices young children into forest to become lost."
  ],
  "Dougla": [
    "A person of mixed Afro-Trinidadian and Indo-Trinidadian heritage, more recently this term is used to refer to anyone of mixed (interracial) parentage. In the Bhojpuri and Awadhi dialects of the Hindustani language it means bastard. [from Bhojpuri Hindustani].",
    "Mixture of East Indians and African parentage."
  ],
  "Doux doux": [
    "Sweet, a term of endearment, esp. in the context of romantic love, or caring for a baby or small child. E.g. Leanna doux douxed the crying baby in her arms until it fell asleep."
  ],
  "Draggin tong": ["Means intense kissing. From 'Dragging tongue'."],
  "Dress 'round'": ["Means to move over."],
  "Drop": ["A ride by car or other vehicle."],
  "Drops": [
    "Baked pastry traditionally made with grated coconut. E.g. Coconut drops."
  ],
  "Dulaha": ["Newly-wed husband or groom [from Bhojpuri Hindustani]]."],
  "Dulahin": ["Newly-wed wife or bride [from Bhojpuri Hindustani]."],
  "Dunce": [
    "When a person is not considered smart. Some one who does not have a good intellect."
  ],
  "Dutty": ["Dirty."],
  "Duttyness": [
    "Dirtiness. An abhorrent person. \"Eg. David slept with an 8 year old goat. He is a real duttyness.\"."
  ],
  "Duss-it": ["A firm command to go away quickly or 'beat it!'."],
  "Eh Eh": [
    "An expression indicating one's disapproval.",
    "An exclamation of surprise or indignation, often said with much emphasis for effect."
  ],
  "Eh Heh": ["Translates to \"is that so\"(usually for sarcasm)."],
  "Eid": ["(Pronounced 'EED') Muslim religious festival."],
  "Ent?": [
    "\"isn't that so?\" , \"right?\" (used at the end of a sentence for emphasis; is similar to Spanish \"¿no?\").",
    "Is that not so? Thats true, isnt it?.",
    "Is that not so? That's true, isn't it?."
  ],
  "Fadda": [
    "A word to adress another male figure, whether friend, acquaintance or foe. Also used to exclaim in vain, eg \"Fadda!\" which is derived from \"Oh God!\"."
  ],
  "Fas": ["Nosy."],
  "Fête": [
    "A party, usually the parties around Carnival time are referred to as fêtes [from French]."
  ],
  "Fig": ["Banana."],
  "Five-fingers": ["Fruit also known as 'Carambola' or 'Star fruit'."],
  "Flambeau": [
    "A lighted torch, usually made from a beer bottle and filled with kerosene."
  ],
  "Flato": [
    "The name of a salt-water food fish with a disk shaped flattened body."
  ],
  "Flickin": [
    "Used to emphasise other words (for example, \"gih mih de flickin ting nah!\" [\"give me the damn thing please\"]) when one is irritated. It is used in a more vulgar sense, though is more acceptable than direct foul language. Similar words are blinkin, blasted, friggin and stinkin."
  ],
  "Flim": [
    "Film.",
    "Film.",
    "Film - Movie as in 'Meh fav'rite flim star Clint Eastwood; he a ral badjohn in trut, y'know!'."
  ],
  "Fire-side": [
    "(AKA Choolha or Chulha) a small enclosed structure traditionally made out of clay and/or mud, used for supporting a cooking vessel whilst holding a wood burning fire."
  ],
  "Fowl-cock": ["An adult chicken particularly a male of the species."],
  "Friggin": [
    "Used to emphasise other words (for example, \"gih mih de friggin ting nah!\" [\"give me the damn thing please\"]) when one is irritated. It is used in a more vulgar sense, though is more acceptable than direct foul language. Similar words are blinkin, blasted, stinkin and flickin."
  ],
  "Frontish": [
    "A bold demanding person, someone who loves attention or being in the middle of things."
  ],
  "Fuckery": ["Abomination (A situation that causes displeasure or hatred)."],
  "Fyahz": ["When a tobo(turbo) down car over fast."],
  "Gainda": ["Marigold (flower)."],
  "Ganda": ["Used to describe a rotten or spoiled egg."],
  "Geera": ["Cumin spice."],
  "Ghugani": ["Black-eyed peas [from Bhojpuri Hindustani]."],
  "Gih Dem/Geeh Dem": [
    "Means to give someone something i.e., an object or a verbal assault."
  ],
  "Giddy": ["Dizzy."],
  "Gimmeh or Gimme": ["Command for 'Give me'."],
  "Gobar": ["Dried cow dung [from Bhojpuri Hindustani]."],
  "Gone tru": [
    "Means lacking vigor or stamina, can't keep up, beaten or defeated."
  ],
  "Go-so": ["A command meaning 'Go there' or 'Move there'."],
  "Gramoxone": [
    "Trade name for paraquat dichloride, a weed killer, commonly used to commit suicide. Any poison ingested, will still be called gramoxone, whether or not if it was actually gramoxone. A very popular choice. E.g., \"Yuh hear? She drink gramoxone and dead!\" sometimes called \"Indian Champagne/Tonic\" since at one time it was usually only persons of Indian descent that used this as the method of choice to commit suicide."
  ],
  "Gros Michel": ["(Pronounced 'Grau-me-shell') A variety of banana."],
  "Gulab jamoon": ["(Food) Sweet of Indian origin."],
  "Gyirl or Gyul or Gyal": ["Refers to 'Girl'. E.g. Aye Gyirl! (Hey Girl)."],
  "Handle": [
    "To take care of something or someone, or to provide assistance. E.g., \"Doh worry yuhself, he go handle yuh on that.\"."
  ],
  "Haradee or Hardi": [
    "Tumeric plant of the ginger family grown for its rhizome."
  ],
  "Hard-back-man": ["Means a grown or physically matured male person."],
  "Hef": [
    "To guage the weight of something by lifting it. E.g., \"I too weak to lift dat bag. Hef it yuhself an see how heavy it is.\"."
  ],
  "Ho": ["A whore or prostitute or a promiscuous woman."],
  "Hops": [
    "A small bread bun that is commonly used in making single serve sandwiches."
  ],
  "Horn": [
    "To cheat on someone, to be unfaithful (unknown derivation: Horny) (relating to the horns associated with cuckoldry).",
    "To cheat on your spouse or lover, as in \"She horning him like reindeer!\".",
    "What you receive when your significant other is seeing someone else behind your back."
  ],
  "Hornerman": [
    "The man with whom a woman (already involved in a committed relationship) is having an affair.",
    "A guy who makes love to someone's wife."
  ],
  "Hornerwoman": [
    "The woman with whom a man (already involved in a committed relationship) is having an affair."
  ],
  "Hoss/Horse": ["A good friend or pal."],
  "Huille": ["(Pronounced 'Wheel') species of snake, Anaconda."],
  "Imps": ["An idiot/demon."],
  "Iyo or Ayo": ["When the string of a flying kite breaks or snaps."],
  "Ishwar": ["God in Hinduism [from Bhojpuri Hindi]."],
  "Jaamoon or Jamun": ["Rose apple or Pommerac."],
  "Jack-spaniya or Jack-Spaniard": ["Species of wasp (insect)."],
  "Jadu": ["Magic [from Bhojpuri Hindustani]."],
  "Jahaji bundle": [
    "A big bag containing one's personal items. E.g., \"Dis one always walk wid she jahaji bundle everyway she go.\" [from Bhojpuri Hindustani]."
  ],
  "Jagabat": [
    "Woman of ill repute (specifically, a female prostitute), also jammet.",
    "Slut, loose woman, prostitute. also Wajang (wah-jang) or Wabean (wah-bean)."
  ],
  "Jalebi": [
    "(Pronounced 'Jelaybee') A sweet food similar to funnel cake that is dipped in a sugary syrup."
  ],
  "Jammet or Jammette (Djamet)": [
    "A woman or questionable morals or a woman who adopts a rather abrasive and aggressive form of communication with the public. Can also refer to a prostitute."
  ],
  "Janjee": [
    "Also known as 'Zangee'. Eel like fish that inhabits freshwater ponds and waterways."
  ],
  "Jep": ["Species of wasp (insect)."],
  "Jeth": ["Husband's younger brother [from Bhojpuri Hindustani]."],
  "Jetani": ["Husband's younger brother's wife [from Bhojpuri Hindustani]."],
  "Jhandi": [
    "Hindu prayer flag that is mounted to a tall bamboo pole and put up in the front of the yard near the home's mandir or in front of a business or mandir after a puja, and the color of the flag is based on the deity worshiped [from Bhojpuri Hindi]."
  ],
  "Jhanjat": ["A big fight, trouble or confusion [from Bhojpuri Hindustani]."],
  "Jinga": ["A form of black magic or a salt-water species of food fish."],
  "Jock": [
    "To masturbate, especially male masturbation (a slang term, but not ordinarily considered derogatory or rude). Contrast with traditional North American defintion of \"Jock\"."
  ],
  "Joekey or Jokey": ["To describe something or someone that is funny."],
  "Jook": [
    "To poke or thrust a pointed object at something. Similar to 'Chook'.",
    "To stab at anything."
  ],
  "Joon-joonie": ["Muscle cramp."],
  "Jouvert": [
    "(Pronounced 'Jouvay') Opening morning of Carnival Monday.",
    "It is French as many of the Carnival terms since we got our Carnival from the French who got it from Africa and was developed in the late 1880's. It stands for the opening of the dawn. It describes mas in the early dawn on Carnival Monday wearing costumes of mud, old clothes (Ole Mas), devil costumes or satirical themes. It starts around 4 am but lately it is held as early as 2 am."
  ],
  "Jumbie": [
    "(From French creole 'Zombie') A ghost, evil spirit or scary creature. E.g. \" Ah see ah jumbie last night!\" or \"The Jumbie go hold yuh!\". Also when someone constantly harasses you. E.g. \" He only jumbie-ing me\".",
    "An African word meaning spirit. Used a lot to describe a weird / eccentric person. Hence, a 'pan jumbie' is someone who's totally consumed by pan. Some of the old steel band men even call themselves \"pan whore\".",
    "Spirit, ghost."
  ],
  "Jump-and-kiss": ["A species of Portulaca (flowering plant)."],
  "Jus-now": ["In a moment, just a moment please, just awhile ago or wait."],
  "Kachoree or Kachori": [
    "A fritter made of split peas flour normally served with chutney."
  ],
  "Kala": ["Black [from Bhojpuri Hindustani]."],
  "Kala Jadu/Obeah": ["Black magic [from Bhojpuri Hindustani/Yoruba]."],
  "Kaale Log|Kaala": [
    "People of African or Creole-Mulatto decent [from Bhojpuri Hindustani]."
  ],
  "Kalchul or kalchool": ["A ladle normally used for dal."],
  "Kang-ka-lang": ["Vagina or female private parts."],
  "Khurma": [
    "A traditional Indian sweet that is deep fried and coated with sugar [from Bhojpuri Hindustani]."
  ],
  "Kilkeedey": [
    "To fall awkwardly or how you look on the floor after falling awkwardly, usually with arms flailed in some odd sort of fashion. Eg. \"When de defenda' tackle him, Roger fall down kilkeedey on de ground\"."
  ],
  "Kiskadee": ["A species of yellow breasted bird."],
  "Kuchela": [
    "A hot spicy condiment normally made from Mango [from Bhojpuri Hindustani]."
  ],
  "Labass": ["A dumping ground or dirty place."],
  "La diablesse": [
    "(Pronounced 'Lajabless') a mythological two-legged she-devil whose possesses a leg of a human and a leg of an oxen, who roams the dark night in search of male victims (from French)."
  ],
  "Laddoo": ["(Food)type of ball shaped yellowish sweet of Indian origin."],
  "Lagahu": [
    "A mythological human being who has the magical powers to transform into a four-legged animal that roams the dark night in search of human victims."
  ],
  "Lagniappe": [
    "Bonus.",
    "A little extra, a bonus (the last child born many years after his/her siblings)."
  ],
  "Leepay": [
    "Ground covering made with cow dung and dirt [from Bhojpuri Hindustani]."
  ],
  "Lemme or Leh-meh": ["Let me."],
  "Lick-down": ["To push over something by force."],
  "Lick-up": [
    "To smash or annihilate someone or something (also: lick-down). Can also be used to indicate consumption or completion of food or drink, usu. in a greedy or hurried manner. E.g. We lick-up the KFC before we went to the party."
  ],
  "Licks": [
    "Corporal punishment, may also be used figuratively when someone or a team is beaten badly eg in sport (eg. the football team get some real licks!). Variations: Licks like peas, Licks like fire which are used for emphasis.",
    "A beating, physical punishment."
  ],
  "Lime/Liming": [
    "A party or any get-together/to hang out, or (more recently) to date someone."
  ],
  "Locho": [
    "(pronounced low-cho) a person who \"mooches\" off of someone else."
  ],
  "Loelee": ["Penis."],
  "Lohra or lowra": [
    "A stone, especially one used for grinding herbs and spices."
  ],
  "Love off": ["To have fallen for a person."],
  "Loya or Loy": ["The dough ball of a roti before it is flattened."],
  "Macafouchette": [
    "Left over food [from Fr. ma ca fourchette, food stuck between the fork]."
  ],
  "Maco": [
    "A nosy person/peeping Tom (also: Macco, Macocious, Macomere), or the act of being nosy.",
    "A person who minds other people's business for the purpose of gossip."
  ],
  "Macajuel": [
    "(Pronounced 'Maca-well') is a species of snake, also known as Boa Constrictor."
  ],
  "Mad-blood": [
    "An undiagnosed medical condition that manifests itself in discoloration and/or itching of the skin."
  ],
  "Mad bull": [
    "A very high flying powerful kite that usually makes a sound while in flight."
  ],
  "Madinga": ["An derogatory term for a Muslim person."],
  "Magga": ["Means very thin or skinny.", "Very thin, skinny."],
  "Mai, Mata, Maiya, Ma": [
    "Mother [Amma is from Tamil and other Dravidian/South Indian languages]."
  ],
  "Maljo": ["Evil eye [from Fr. mal yeux,  bad eyes]."],
  "Malkadee": [
    "Convulsions, sickly, unhealthy or crazy.",
    "Blight, unhealthy, ill."
  ],
  "Mamaguy": [
    "To falsely compliment someone with the hope of indirectly persuading them in your favor [from Spanish 'mamar gallo'].",
    "To fast talk or sweet talk, to try to fool, make fun of or ridicule.",
    "To make fun of, to ridicule."
  ],
  "Mamma-man": [
    "An offensive slang for a male who involves himself in the affairs of women or a homosexual male."
  ],
  "Mamma-teyta": ["Species of fish in the catfish family."],
  "Mammeecipote": [
    "A large locally grown fruit which contains firm sweet flesh."
  ],
  "Mamu": ["Maternal uncle."],
  "Massala": [
    "Combination of ground spices commonly used in East Indian cuisine."
  ],
  "Mausa": ["Maternal aunt husband."],
  "Mausi": ["Maternal aunt."],
  "Mampee/Mamps": ["An extremely overweight female."],
  "Manicou": [
    "An one of five species of opossum, most commonly Didelphis marsupialis."
  ],
  "Mapipire": ["(Pronounced 'Ma-peepee') a venomous species of snake."],
  "Mauvais langue": [
    "To malign.",
    "To bad talk someone, or engage in damaging gossip."
  ],
  "Mohan Bhog": ["(Food) Sweet meal used for Hindu devotional worship."],
  "Moo-yuh-ass!": ["Means to move yourself. Literally 'Move your ass!'."],
  "Mook": ["A person who is shy, or socially awkward. (also: Mooksie)."],
  "Moonshine": ["Bootleg alcohol."],
  "Muck": ["Dirt or scum that accumulates on the skin."],
  "Muddacunt": [
    "A vulgar curse word cursing a mother's vagina. (usually used in the phrase \"haul yuh muddacunt\" or simply \"yuh muddacunt\", meaning \"fuck off\" in a somewhat more vulgar fashion. is also used when angrily suprised by a situation and is usually dictated: \"but what de muddacunt is dis?\" or more simply, \"what de muddacunt is dis?\", or \"what de muddacunt?\"."
  ],
  "Naanny": ["Slang for vagina or female private parts."],
  "NATO": [
    "Acronym for No Action Transport Only used for person who drives a car full of women but will not be getting any \"action\" hence no dig or chook."
  ],
  "NAH": [
    "1. A means of responding negatively (i.e. saying no). 2. A means of saying please (e.g. lemme get a wet ah yuh sof' drink nah?\") 3. A random useless english of sentences (e.g.1 i eh really know na, eg.2 SWEAR TO GOD NAH)."
  ],
  "Namakharam": [
    "Ingrate, especially in a political context [from Bhojpuri Hindustani \"Namak Haram\"]."
  ],
  "Nana": ["Maternal grandfather [from Bhojpuri Hindustani]."],
  "Nani": ["Maternal grandmother [from Bhojpuri Hindustani]."],
  "Neva see come see": [
    "Someone who has recently been exposed to something new and who overdoes it to ridiculous proportions or a term used to describe a person who is thought to be socially backwards but pretends to be advanced."
  ],
  "Nigger, Nigga, or Negro": [
    "Used as a racial slur towards people of African or Creole-Mulatto descent."
  ],
  "Nuttin": ["Nothing."],
  "Obeah or Obi-ah": ["Black magic."],
  "Obzokie": ["Awkward, out of place usu. in a derogatory manner."],
  "Ochro or Okro": ["Okra (Vegetable)."],
  "Oh Gad Oye!": [
    "An expression of surprise or shock or of something scandalous."
  ],
  "Oh Gawd!": [
    "An expression of concern or surprise or shock or of something scandalous."
  ],
  "Oh Gawsh!": ["An expression of disappointment or disapproval."],
  "Oh Geed!": ["An expression of disgust or scorn for something dirty."],
  "Oh Gyad!": ["An expression of disgust or scorn for something dirty."],
  "Oh Lawd!": [
    "An expression of surprise or disappointment or of something scandalous."
  ],
  "Ol' ho": ["A promiscuous older woman."],
  "Ole maid or Old maid": [
    "A species flowering plant also known as Madagascar periwinkle."
  ],
  "Oou Guude!": ["An expression of amazement or something scandalous."],
  "\"Oy/Oye\"": ["Aye/Hey!."],
  "Pachownie": ["A curry dish made with the tripe of various animals."],
  "Pampalam": ["Vagina or female private parts (Shortened to 'Pampam')."],
  "Panty-man": [
    "An offensive term for an effeminate male or a homosexual male.",
    "Tell tell."
  ],
  "Papa Bois": [
    "(Pronounced 'Papa Bwah') A mythological human-like creature that lives in the forests and protects wild animals by harming hunters (From French)."
  ],
  "Papee-show": [
    "Behaving or acting in a very dramatic manner; or acting in a manner with the purpose of deceiving or hiding the truth."
  ],
  "Par-aaja": ["Paternal great-grand father [from Bhojpuri Hindustani]."],
  "Par-aaji": ["Paternal great-grand mother [from Bhojpuri Hindustani]."],
  "Par-nana": ["Maternal great-grand father [from Bhojpuri Hindustani]."],
  "Par-nani": ["Maternal great-grand mother [from Bhojpuri Hindustani]."],
  "Parsad": ["(Food) Sweet meal used for Hindu devotional worship."],
  "Pastelle or Pastel": [
    "A savory food traditionally made steamed or boiled in banana leaf consisting primarily of ground corn with a meat filling. Popular during the Christmas season."
  ],
  "Pati": ["Husband [from Bhojpuri Hindustani]."],
  "Patni": ["Wife [from Bhojpuri Hindustani]."],
  "Patois (Pronounced 'Patwa')": ["A french-based creole language."],
  "Paynoose": [
    "A sweet food with various cheese-like textures normally made from the 'Colostrum' or first milking of a cow after giving birth."
  ],
  "Paymee": [
    "A sweet food traditionally made steamed or boiled in banana leaf consisting of ground corn, coconut, sugar and other ingredients and species."
  ],
  "Peepee": ["To urinate or the urine itself."],
  "Peera": ["A small wooden bench."],
  "Peewa": ["Edible fruit of a native palm species."],
  "Pelau": [
    "A rice based dish traditionally made with pigeon peas and meats such as chicken or beef.",
    "A one-pot mixture of pigeon peas and rice, cooked with meat and flavoured with coconut and pepper."
  ],
  "Penlight battery": ["AA battery."],
  "Perah": ["(Food) Sweet of Indian origin."],
  "Petite quart": [
    "(Pronounced 'Pity kort') is a small sized bottle used to measure alcohol."
  ],
  "Phagwa": [
    "Hindu spring festival also known as 'Holi'.",
    "An Indian Hindu festival brought to Trinbago by Hindu members of the Indian community who came as indentured servants of the British colonials who ruled India at the time."
  ],
  "Pholourie": [
    "Deep fried (flour with split peas powder and turmeric) balls [Bhojpuri Hindustani]."
  ],
  "Picky head": [
    "To describe someone with short, curly, thin, Afro-textured hair."
  ],
  "Pimento": ["A variety of pepper used for flavoring dishes."],
  "Pissin-tail": [
    "A derogatory term to describe a person (normally a male) or something that is believed to be weak or inferior."
  ],
  "Pita, Baap, or Pa": ["Father [Bhojpuri Hindi]."],
  "Planass": ["A beating with the flat side of a cutlass or machete blade."],
  "Plantin": ["Plantain fruit."],
  "Poan or Pone": [
    "(Rhymes with 'Groan') is a sweet dense starchy cake traditionally made with Cassava and other ingredients."
  ],
  "Pois doux": [
    "(Pronounced 'Pa-doo') is a tree species and its fruit pods which contains seeds encased in an edible sweet pulp. (From French meaning Sweet Peas)."
  ],
  "Pommerac": [
    "Syzygium malaccense or Otaheite apple, a pear shaped fruit become bright red when ripe, also know as the Malay apple or Wax Jamboo.",
    "A bright red fruit with velvety white interior; could have come from the patois for Maracas apple."
  ],
  "Pommecythere": [
    "Spondias cytherea or Golden apple, a fruit with a green skin, which when ripe turns to a gold colour."
  ],
  "Pongkin": ["Pumpkin."],
  "Pot Hound": [
    "Usually refers stray dog that probably is not of a specific breed or a dog that eats anything off the street (also: Pot Hong). May also refer to a person of mixed ethnic background. (This is a racially offensive use of the term)."
  ],
  "Preshaah!": ["Pressure, to feel pressure due to a situation one is in."],
  "Prick": [
    "Penis or an offensive term used to describe a detestable or an ignorant male. Similar to North American 'Dick'."
  ],
  "Puchara or Poochara": [
    "A cooking utensil with a brush-like cloth end used for applying or spreading cooking oil when making rotis."
  ],
  "Pudden": ["Blood pudding (Food)."],
  "Pull Bull": [
    "To operate an unlicensed taxi, using your private car as a taxi in order to earn extra money. To operate a licensed taxi without a taxi-driver's license. Also referred to as doing 'PH'. May also refer to male masturbation."
  ],
  "Pum-Pum": ["Vagina or female private parts."],
  "Punch-a-creme or Poncha-crema": [
    "A sweet dairy based beverage with or without alcohol (Rum) popularly served during the Christmas season. Similar to 'Egg Nog'."
  ],
  "Puncheon or Puncheon rum": ["Is a high proof heavy type rum."],
  "Pundit": ["A Hindu religious priest."],
  "Puttigal or Poottigal": [
    "A variety of citrus fruit related to tangerine (Derived from 'Portugal')."
  ],
  "PJ": ["To be on a Private Job."],
  "Raaff": ["To snatch something. To steal in a boldface manner."],
  "Rag-up": ["To verbally dominate and insult a person."],
  "Rakshas": ["A demon (From Hindustani)."],
  "Ragamuffin": [
    "A usually unkempt person who does not work always roaming some times commits petty crimes."
  ],
  "Rango-Tango": ["A state of disarray or of being unkept."],
  "Real/Rehl": [
    "Extremely (for example, \"dah real bad\" means \"that's really good\"."
  ],
  "Renk": ["A term used to describe a very foul odor."],
  "Romey": ["Card game also known as 'Rummy'."],
  "Rote": ["(Food) Sweet of Indian origin."],
  "Roti": [
    "Several varieties of flat bread.",
    "A thin flat baked dough resembling a tortilla filled with curried beef, chicken, goat, shrimp or vegetables.",
    "East Indian dish made with flat baked dough resembling a tortilla filled with curried beef, chicken, goat, shrimp or other meat with potatoes, onions, tomato and spices."
  ],
  "Roucou": [
    "Fruit of the achiote tree whose seeds are used to produce an orange-red condiment and food coloring called 'Annatto'."
  ],
  "Saapee": ["Cooking rag or kitchen towel."],
  "Saga boy or Saga girl": [
    "A very well dressed and/or stylish male or female."
  ],
  "Saheena": [
    "Deep fried dal fritter made with either spinach or dasheen [from Bhojpuri Hindustani]."
  ],
  "Same or Sayme or Seim": ["A species of green beans."],
  "Sapodilla": [
    "Locally grown thin-skinned brown colored fruit with a sweet pulp."
  ],
  "Sawl-fish": [
    "Salted Fish or Vagina or female private parts. From 'Salt fish'."
  ],
  "Scyant or Scant": ["To b-boy or breakdance."],
  "Scyant-out or Scant-out": ["A breakdancing battle."],
  "Sea tattoo": [
    "A small species of crustacean that inhabits sandy seashores, also known as, Mole Crab or Sand Crab."
  ],
  "Sem": ["Seven."],
  "Seven colors": [
    "Native wild species of guppy fish said to display the seven colors of the rainbow."
  ],
  "Sive or Saive": ["(Rhymes with 'Dive') Chive (herb)."],
  "Soca-Princess": [
    "A female player in the Trinidad & Tobago National Footbal(soccer) Team."
  ],
  "Socawarrior": [
    "A male player in the Trinidad & Tobago National Football(soccer) Team."
  ],
  "Socawarriors": ["The male National Football (Soccer) Team."],
  "Soft hair": [
    "A term used to describe Afro-textured hair that is less coiled and considered easier to style."
  ],
  "Sometimeish": [
    "Describes a moody or unpredictable person.",
    "Moody.",
    "Moody."
  ],
  "Sorrel": [
    "(also known as 'Roselle') is a Hibiscus plant species grown for its fruit which is steeped and made into a beverage popular around the Christmas season. Plant, Fruit and Beverage all referred to as 'Sorrel'."
  ],
  "Sou-Sou": [
    "A form of communal savings in which each member benefits from a rotational lumpsum."
  ],
  "Soucouyant (Pronounced 'Soucou-niya')": [
    "A female thought to be a vampire, who sheds her skin and flies in the night sky as a ball of fire. This term is also used to describe an evil woman."
  ],
  "Sour": [
    "A term used to describe someone in an angry mood or a relationship that has gone bad."
  ],
  "Soursop": ["A large fruit with green spiky skin and white juicy pulp."],
  "Souse": [
    "A soup-like dish traditionally made with bony animal parts (normally Pig or Chicken) and/or vegetables cooked and pickled in a thin broth.",
    "Boiled pork or other meats served cold in a tasty, seasoned sauce with lime, cucumber, pepper and onion."
  ],
  "Snat": [
    "Snot, phlegm or mucous from the nose. E.g. A 'snatty' nose is a runny nose."
  ],
  "Steups": [
    "The act of sucking air pass one's teeth, creating a sound of disapproval (also: steupse, chups, cheeups)."
  ],
  "Stinkin": [
    "Used to emphasise other words (for example, \"gih mih de stinkin ting nah!\" [\"give me the damn thing please\"]) when one is irritated. It is used in a more vulgar sense, though is more acceptable than direct foul language. Similar words are blinkin, blasted, fleckin, friggin and flickin."
  ],
  "Suck Eye": [
    "Boasting that something is 'really easy' to do, when its not easy to the average person."
  ],
  "Sweedrink or Sweetdrink": [
    "Carbonated beverage, commonly called \"Soda\" or \"Pop\" in other countries."
  ],
  "Sweetie": [
    "Hard candy.",
    "Any confectionary, an attractive female.",
    "Any confectionary."
  ],
  "Swell-up": [
    "Swollen or when a person demonstrates a posture of being unhappy or displeased."
  ],
  "Tabanca": [
    "In a love sick state. Describes how someone feels after being cheated on by their loved one. Can also describe unrequited loved. (Taban-truck is the more severe form of Taban-car].",
    "The forlorn feeling one gets when a romantic relationship ends.",
    "The forlorn feeling one gets when a love affair is over."
  ],
  "Tambran": ["Tamarind."],
  "Tankobean": ["Specific native fruit species also known as 'Tonkabean'."],
  "Tanty": ["Aunt, also a term for any woman older than oneself."],
  "Tanty-man": [
    "An offensive term for an effeminate male person or a homosexual male."
  ],
  "Tatu": [
    "Armadillo derived from Tupi ta'tu, also called Tatu in Brazilian Portuguese."
  ],
  "Tawa": [
    "A flat round cooking stone made out of iron used to cook flat-breads like roti."
  ],
  "Teef": ["Thief.", "Thief.", "Trini pronunciation Thief."],
  "Throw Waist": ["To dance, specifically to \"wine\"."],
  "Ting": ["Thing.", "Thing."],
  "Tootoolbay": [
    "In a confused state or in a daze because of love problems. Similar to Bazodee. E.g. Richie was tootoolbay after he met the girl in the fete."
  ],
  "Tout": [
    "A person hawking goods or services on the street, usually maxi taxis (minibuses). Also refers to a maxi taxi conductor in some cases."
  ],
  "Toe Jam": [
    "Smelly substance that accumulates between the toes or Foot fungus that smells on unclean feet."
  ],
  "Toelee": ["Penis."],
  "Topitambo or Tipitambo or Pititambo": [
    "A native species of root vegetable."
  ],
  "Toting": [
    "One who carries feelings or holds a grudge for an unnecessary amount of time."
  ],
  "Toetee": ["Penis."],
  "Toolum": [
    "A candy (snack) made with coconut and molasses.",
    "A candy made with molasses and grated coconut."
  ],
  "Toonie": ["Vagina."],
  "Touchlight or Torchlight": ["A flashlight or torch in UK English."],
  "Trini to de Bone!": ["Pride in oneself for being a Trinidadian."],
  "Tulsi or Toolsie": [
    "A species of basil plant that has religious significance to Hindus."
  ],
  "Tun tun": ["Vagina."],
  "Tutu": ["To defecate or the feces itself."],
  "Twenty-four hours": [
    "Small species of lizard, falsely touted to be venomous, where victims only have 24 hours to survive after being envenomed."
  ],
  "Vex": ["Angry or Upset.", "Angry, vexed."],
  "Vikey Vike/ Vikey Vai": [
    "To act with irresponsibility, or to act without concern for others. To do something in a haphazard manner. Eg. \"De country in turmoil because of vikey vike decision making.\" Eg. \"My wife acting vikey vike. Everytime my back turn she out de door limin' with she friends\"."
  ],
  "Wah do you? or Wat do yuh?": [
    "Inquiring question meaning 'What's wrong with you?'."
  ],
  "Wajang": [
    "\"Ghetto/ Hood rat\" usually associated with poor conduct.",
    "A roudy, uncouth person.",
    "A roudy, uncouth person."
  ],
  "Wappee": [
    "Saliva or drool that leaked from the mouth and becomes dried or crusted on the face."
  ],
  "Way-Way or Whe-Whe": ["An illegal game of gambling."],
  "Wuz de scene? or Wah iz d'scene?": [
    "A casual greeting equivalent to what's happening. (is sometimes said \"wuz de good?\" or \"wuz de vibes?)."
  ],
  "Wham now?": [
    "Greeting equivalent to \"what's happening now\". E.g. \"Aye Reeza, wham now?\".",
    "What's up or how are you? It's considered a Greeting!."
  ],
  "Whappen?/Wham?": ["What happened?."],
  "Whey/Whey Sah": [
    "Something shocking, astonishing or unbelievable. E.g. \"Whey! If you did see that show!\"."
  ],
  "Wine": [
    "A seductive form of dance involving circular or semi-circular movement of the hips especially. Can be done alone, with a partner, or many partners. E.g. \"Javed was wining in the party on several women\"."
  ],
  "Way": ["Where, for example \"way yuh dey?\" means \"where are you?\"."],
  "Wood": ["Penis.", "Slang for penis."],
  "Wood lice": ["Termites."],
  "Yampee": [
    "The mucus that surrounds one's eye in the morning.",
    "Mucus found in the corner of the eyes, especially after a long nights sleep.",
    "Mucus, found in the corner of the eye."
  ],
  "Yankee": ["Pronounced (Yang-kee) an American."],
  "Ying/Yeng": [
    "A derogatory slang word meaning tight. Mostly used to refer to someone's clothing (primarily pants)."
  ],
  "Yuh": ["You."],
  "Zaboca": ["Avocado.", "Avocado, a salad fruit."],
  "Zangee": [
    "Also known as 'Janjee'. Eel like fish that inhabits fresh water ponds and waterways."
  ],
  "Zug-up or Zog-up": [
    "Description for a bad haircut or being misshaped. A person with a bad haircut may be called 'Zug-head'."
  ],
  "Ah": ["Substitute for I.", "Substitute for 'I'."],
  "Ahse": [
    "Ass.",
    "Trini pronunciation (Ass) See Bam Bam e.g. Why yuh doh hull yuh ahse?."
  ],
  "Air": ["Ear.", "Trini pronunciation Ear."],
  "Airish": ["Proud."],
  "Alipang": ["Man's hair-cut."],
  "Arwe": ["Ours, us."],
  "Ash Wednesday": ["Ash Wednesday is the day after carnival."],
  "Ax": ["Ask. To ask a question.", "Ask. To ask a question."],
  "Ah-yah-yai": ["An expression of anticipation or pain, etc."],
  "Back back": [
    "Suggestive dance; the male dancers front rubbing against the females."
  ],
  "Back chat": [
    "Insolent response, especially from a child to an adult. Females rear or vice versa.",
    "Insolent response, especially from a child to an adult."
  ],
  "Badderation": ["Problems, mischevious."],
  "Bad eye, cut-eye": [
    "A look of anger or reproach, especially when looking from the corner of the eye."
  ],
  "Bad-John": [
    "A bully, a dangerous man, a gangster, someone with a reputation for hurting people."
  ],
  "Bam-se Lambay": ["An attractive female buttocks."],
  "Bam bam, Boom-boom": ["Backside, behind, ass, bottom, buttock."],
  "Basa basa": ["Argumentatve, confrontational."],
  "Bawlin": ["Confused."],
  "Baygo, Baigo": ["Tobago."],
  "Beyganne, Biganne": [
    "The vegetable melongene, eggplant (Solanum melongena)."
  ],
  "Big pappy": ["Bourgeois."],
  "Bol-Face": ["Bold Face, Pushy, loud and wrong, unreasonable, demanding."],
  "Boo-boo-lups": ["Fat, clumsy ungainly person."],
  "Boomsie": ["Backside, behind, ass, bottom, buttock."],
  "Boushettte": ["The tip of the sternum."],
  "Brought-up-sy": ["Showing that a person was properly brought up, decorum."],
  "Bragadang": ["In a state of disrepair."],
  "Bragadacious": ["Boastful."],
  "Breed": ["Impregnate."],
  "Buh wait nah": [
    "But wait a minute, now hold on, now wait!.",
    "But wait a minute, now hold on/it."
  ],
  "Bum-bu toe": ["A sore toe."],
  "Bun, Bon": ["Burnt."],
  "Bun-bun": ["Food left in the bottom of the pot."],
  "Buse": ["To talk agressively to; to abuse verbally."],
  "Buss Up Shut": [
    "Shredded roti skin, served with curried meats, vegetables etc.",
    "(Pharata) See Roti, Shredded roti skin, resembling a 'bust up shirt'."
  ],
  "Burrokeet": ["Human donkey."],
  "Calinda": [
    "A Spanish dance music. Trinbago had Spanish Colonialists whose culture and music affected and influenced the island's music. Calinda is a word for the early stickfights."
  ],
  "Carnival Band": [
    "A group of Carnival revellers, may be as over 4,000 individuals."
  ],
  "Calypso": [
    "A musical and lyrical comment on any subject, profusely composed for, but not limited to the Carnival season. It is the English version of Kaiso which is west African.",
    "A musical and lyrical comment on any subject, usually composed for, but not limited to, the Carnival season."
  ],
  "Calypso Monarch": [
    "A title given to the singer who wins the Calypso competition every year at Carnival time."
  ],
  "Calypsonian": ["One who sings calypsoes.", "One who sings calypsoes."],
  "Caroni": [
    "An Indian village in Trinbago. Derived form an Indian word. There is also a swamp called Caroni Swamp."
  ],
  "Channa": ["Chick peas, a nutritious legume."],
  "Chantwell": [
    "A French word to describe a type of music and dance. A Chantwell (chanter = to sing) was the singing front man of the early stickfighters (calinda). For not being the first who got knocked out by a hit of the bois, he has worn kind of a helmet made from pots and clothes. It might have been the first form of Calypsonian."
  ],
  "Cheups/Steups": ["A derogatory sound noise made by sucking your teeth."],
  "Chinkee, chinkeey": ["Very tiny or small portions of anything."],
  "Chupidee": ["A foolish person.", "A foolish person."],
  "Chutney Soca": [
    "The Indian version of Soca. Started in the 80s. Trinbagonians will tell you: \"Chutney is the most rum intense of all Trinidadian music forms\"."
  ],
  "Coki-eye": ["Cross-eyed."],
  "Commesse": [
    "Confusion, controversy, associated with argument, gossip and slander."
  ],
  "Compere": ["Male companion or friend, god-father."],
  "Conga Line": ["Wining in a row."],
  "Conventional band": ["A large steelband."],
  "Coo-coo": ["A traditional cornmeal pudding with ochro and vegetables."],
  "Coo-coo nah a soak": ["Cannot agree."],
  "Cork": ["Constipated."],
  "Coskel / Koskel": ["Weird, strange."],
  "Crack": ["Crazy, insane."],
  "Crapo, Crapaud": ["Frog."],
  "Crapo smoke he pipe": ["He is in a lot of trouble, he is already done for."],
  "COTT": [
    "The Copyright Music Organisation of T&T who represents composers, songwriters, lyristics, and music publishers."
  ],
  "Cuff": [
    "To punch or hitting with a cleched fist.",
    "Hitting someone or something with a cleched fist."
  ],
  "Cunumunu": ["Idiot, foolish, stupid person."],
  "Cut yu kards straight": ["No scheming."],
  "Cutlass": [
    "A long knife. It was used by the Indians to cut the sugar cane during their indenture ship in the late 19 c in Trinbago. It was infamous for its use in fights, especially the Carnival fights. It's other name is machete."
  ],
  "Cyaa, Cyah": ["Can't, can not."],
  "Dan-dan": ["Fashionable clothes.", "Any sharp looking outfit."],
  "Dada head": ["Thick, hard niggery hair."],
  "Dardy": ["Father."],
  "Dem say": ["Gossip."],
  "Dholak": [
    "Traditional Indian instrument, a drum played from both sides, to hear in Chutney Socas."
  ],
  "Dimanche Gras": [
    "French for Great Sunday and is the title of the main carnival event called dimanche gras night. On dimanche gras which is carnival Sunday night the calypso competition and the King and Queen of the bands are held. It is a spectacle to begin the carnival on Monday morning (jouvert)."
  ],
  "Dinged": ["Discoloured."],
  "Divali": [
    "An Indian (Hindu) religious festival that is now a public holiday in \nTrinbago. It is a festival of lights."
  ],
  "Doe doe": ["Lie down."],
  "Doh, Dough": ["Don't, do not."],
  "Doo doo / Doux doux": [
    "Sweetheart often used with darling, as in dodo dahling. The French doux means \"sweet\"."
  ],
  "Doogla, Dougla": ["A person of mixed race, usually African and East India."],
  "Doughtish, Dotish": ["Stupid, probably from the English doltish."],
  "Dress rong": ["Move over, shift, I need a seat."],
  "Drevait, Dree vay": ["Way ward person, to knock about."],
  "Dudup": [
    "A bass drum. It is a drum with two notes split in half on the drum."
  ],
  "Dustbin": ["A garbage pan."],
  "Eh": ["What did you say?.", "What did you say?."],
  "Eh eh": ["No, no way, oh no."],
  "Eh heh": ["Oh really? I understand. Yes."],
  "Eid ul Fitr": [
    "A Muslim festival (fasting for one month) and is a holiday ending with Eid ul Adha in Trinbago."
  ],
  "Enless": ["Plenty, endless."],
  "Faddah": ["Father.", "Father."],
  "Fall out": [
    "To stop speaking with someone or to terminate a friendship.",
    "To stop speaking with someone or to terminate a friendship."
  ],
  "Fed up": [
    "The state of being bored.",
    "The state of being frustrated, tired or bored."
  ],
  "Feeding youh face": ["Eating."],
  "Fete, Fet": [
    "A party, loud music, lots to eat and drink, dancing to wee hours of the morning."
  ],
  "Founkie / foong-key": ["Foul smelling, stink odour."],
  "Fresh Water Yankee": [
    "A person who spends a short time in the U.S. and returns with a heavy American accent; originally, one who acquired the accent by simply visiting the U.S. military base without even going overseas.",
    "A Trini who goes to America and comes back acting and talking Yankee (Originally someone acting Yankee without even going overseas, or crossing salt water)."
  ],
  "Follow fashion": ["Imitating."],
  "Free up": ["Relax, let go."],
  "Fruit doh fall far from d tree": [
    "Children aren't usually different from their parents."
  ],
  "Fuh true, Troot?": ["Yes that is true, Is that really so?."],
  "Ghosts": ["Sprits. It is a part of Trinbago folklore."],
  "Good Night": [
    "An evening greeting, used when first meeting someone or entering a home at night."
  ],
  "Grundig": [
    "A famous radio (from the German Grundig company) with a powerful sound. It was top of the line among radios. In the 1950s Neville Jules, captain of Trinidad All Stars steel orchestra created a pan which he called the grundig. It was famous for its tone among the steelbands."
  ],
  "Gyul": ["Trini pronunciation for Girl.", "Girl."],
  "Hair": [
    "Trini pronunciation Here or hear. Hair she (Hear she) Also Hair he I'm quoting her (him) as in \"I ask she 'But why you late?' Hair she, 'You is meh mudder?' \"."
  ],
  "Hambug": ["To pester or bother someone.", "To pester or bother someone."],
  "Heritage festival": [
    "An African festival held every year in Tobago, the twin sister island of Trinidad and Tobago."
  ],
  "Huggish": ["Rude, crude, mean; the behavior of a thug, gangster."],
  "Hut": ["Trini pronunciation for hurt.", "Trini pronunciation Hurt."],
  "In truth": ["For real, no lie."],
  "Jab Jab": [
    "A type of Carnival devil costume; jabs people with his fork and demands money from passersby. The Jab Jab is the oldest Trinidad Carnival character in existance today at the modern carnivals.",
    "A type of Carnival devil costume; jabs people with his fork and demands money from passersby."
  ],
  "Jagabat Slut": [
    "Loose woman, prostitute; also Wajang (wah-jang) or Wabean (wah-bean)."
  ],
  "Jamoo": [
    "An African word. It is a form of Soca music with spiritual content."
  ],
  "Jamboree": [
    "A gathering of community folks to celebrate an occasion, for instance a Pan Jamboree."
  ],
  "Jamette Class": [
    "Jamette class are prostitutes of the lower class. It is French of course."
  ],
  "Jomoline": [
    "Steel pan created in 1970 by Jomo Wahtuse. With 32 notes it covered the range from guitar to soprano. It's meant to be a solo instrument."
  ],
  "Junior Carnival parade": ["The parade for children at Carnival."],
  "Kaiso": [
    "The first name for Calypso. It is derived from a West African word. Later it was anglicized to calypso. Keep Kaiso alive!."
  ],
  "Kings and Queens": [
    "Two individual 'royal' characters of mas bands in the Carnival competition on Carnival Sunday night. They are also known as King of the band and Queen of the band."
  ],
  "Las' Lap": [
    "(Last Lap) The last few minutes before the Carnival ends at midnight on Carnival Tuesday."
  ],
  "Lef Trini": [
    "Leave Trini \"Me eh see she again, she leave de fete long time!\"."
  ],
  "Liming": [
    "Hanging out. It is a local term named after the lime fruit that hangs down from the tree."
  ],
  "Macommère": ["A female companion or friend."],
  "Macocious, Makocious": ["A person who is prying, nosy a maco."],
  "Mas band": ["Costume band during the carnival celebrations."],
  "Mas Camp": [
    "The place where the mas is made for the Carnival. There people gather all night as the Carnival costumes are made. A bar in Port of Spain that houses Calypso shows for Calysonians is called Mas Camp.",
    "Where costumes and floats for Carnival are designed and fabricated."
  ],
  "Makaforshet": [
    "Left overs; from the French phrase ma ca fourchette, meaning food stuck between the fork."
  ],
  "Maljoe": ["A blight, evil spell or misfortune."],
  "Make style": ["Show off, tantalise."],
  "Mama Poule": [
    "A derogatory term for a husband who seems to be controlled by his wife, a weakling, easily taken advantage of.",
    "A weakling, someone who can be taken advantage of."
  ],
  "Mama Yo!": [
    "Expression denoting shock and surprise.",
    "Expression denoting shock and surprise."
  ],
  "Mas/Mass": ["Masquerade, Carnival parade."],
  "Matter Fix": [
    "Everything is well organized, everything is OK.",
    "Everything is well organized."
  ],
  "Mauby, Maubi": [
    "Bark of the tree Colubrina reclinata used to make a delicious drink of the same name."
  ],
  "Meh": ["My."],
  "Melongene": ["Eggplant a vegetable (Solanum melongena)."],
  "Merasmie": ["Un-healthy, sickly looking."],
  "Midnight Robber": [
    "A character in the Carnival. He is dressed in a large hat with decorations and gives speeches to passers by."
  ],
  "Mih han slip": [
    "An expression used when too much of an ingredient is used."
  ],
  "Minstrels": [
    "A Carnival charactere. A quartet with white painted faces to imitate Americans. The Minstrels sing freedom songs of slavery, accompanied by Guitar, Tambourine, Chac-Chac and Toc-Toc."
  ],
  "Mo vey lang": ["Bad tongue, slanderous."],
  "Moko Jumbie": [
    "Stilt dancers, young men that climb and walk on stilts during the Carnival. It is an African tradition. There is also a history of the Moko Jumbie and how he (temporary) died out. He traveled with a companion that was not on stilts, he collected money and the Moko Jumbie would usually collect money from those people living on the 2nd floors of buildings in POS. In those days the merchants lived over their business on the 2nd floors. When the trams were introduced that was the end of the Moko Jumbie as he could not safely navigate throught the many crossing cables and wires. Keep the Moko Jumbie alive!."
  ],
  "Mooma": ["Mother.", "Mother."],
  "Mout open, tory jump out": ["Start to speak and everthing is revealed."],
  "Mouter": ["A boaster."],
  "Much up": ["To pamper, to butter up.", "To pamper, to butter up."],
  "Mud Band": [
    "A J'ouvert mas band with revellers plastering their bodies in mud from head to toe.",
    "A J'Ouvert mas where band members cover their bodies in mud from head to toe."
  ],
  "MUTT": [
    "Musician's Union of Trinidad and Tobago. It is the only Non Governmental Organisation representing musicians in T&T, new founded in July 2006 and headed by Patrick Arnold. MUTT is open to everyone and it's the only union whose members have created an instrument."
  ],
  "Nah": ["No.", "No."],
  "Nanny/Powder puff": ["Female genitalia, vagina."],
  "Nastiness": [
    "An expression of disgust applied to a good-for-nothing person.",
    "An expression of disgust applied to a good-for-nothing person."
  ],
  "National Carnival Committee": [
    "The organization that is responsible for putting the Carnival celebrations together. Over the years it has had many names. Once it was the Carnival Development Committee (CDC)."
  ],
  "Never see come see": [
    "Someone recently exposed to something new thus goes to ridiculous extremes.",
    "Someone who has recently been exposed to something new and who overdoes it to ridiculous proportions."
  ],
  "Ning ning": ["Tired eyes.", "Tired eyes."],
  "Now fuh now": ["Instantly, right now.", "Instantly."],
  "No wherian": ["A person who does not have any fixed place of abode."],
  "Obzokee": [
    "Awkward in appearance, bent or twisted out of shape, misshapen, clumsy.",
    "Awkward in appearance, anything bent or twisted out of shape."
  ],
  "Ochro": ["Okra."],
  "Oh gorm man/Oh shimps man": [
    "These expressions can denote shock, surprise, indignation and admiration."
  ],
  "Oh geed!": [
    "An expression used when an offensive smell is detected.",
    "An expression used when an offensive smell arises."
  ],
  "Ohh gosh!": ["An expression used to indicate surprise or disgust."],
  "Ole talk": ["Idle empty chatter, social chit-chat, nonsense."],
  "One set ah": ["A lot of anything, plentiful.", "A lot of anything."],
  "One han cyaa clap": [
    "One hand cant clap. A bribe will grease the wheels, be good to me I'll take care of you."
  ],
  "Own way": ["Stubborn person."],
  "Pahtnah/Partner": ["Homeboy, used by older Trini males to each other."],
  "Pallet": ["Frozen lolly on stick.", "Frozen lolly."],
  "Panmaker": [
    "The person who does the sinking, grooving and cutting after the specification (i.e. length, depth, size of notes) of his Tuner."
  ],
  "Panist": ["Pan player."],
  "Panorama": [
    "The Trinbago annual Carnival steelband festival that started in 1963 where steelbands compete for the national title of steelband of the year. The competition is run by the representative pan body  Pan Trinbago."
  ],
  "Pan Pusher": [
    "In the 1960s people used to push the steel pans on Carnival days (some still do). There were no trucks to pull the instruments. Hence, the word pan pusher to refer to people who pushed the pans."
  ],
  "Pan Trinbago": [
    "Organization responsible for the steelband movement. This organization is the fourth pan organization formed to protect the interests of the steelpan and panists of Trinbago. It's current President is Patrick Arnold. Former presidents were Arnim Smith, George Goddard and Owen Serrette."
  ],
  "Panyard": [
    "The place that house steelbands in Trinbago. It is so called because the steelbands are placed in a yard, usually the yard of the steelband's leader. There they practice and used the yard as a community center."
  ],
  "Pa pa yo!": ["Exclamation of surprise."],
  "Parang": [
    "Songs in Spanish accompanied with cuatros, fiddles, violins and chac chac It is derived from the Venezuelan heritage of Trinbago. It was started by members of the Spanish community. It is performed during the Christmas holidays. Today you have many Calypsonians singing parang music among whom the most popular are Scrunter, Baron and  Crazy.",
    "Music played during Christmas time. Parang has a lot of Spanish influences."
  ],
  "Parang Soca": ["Parang music done with a Soca beat."],
  "Peong": ["Someone who seems to be addicted or obsessed with something."],
  "Pesh": ["Money.", "Money."],
  "Pholouri": ["Fritters made with split peas."],
  "Piarco": [
    "The international airport in Trinidad.",
    "The international airport in Trinidad."
  ],
  "Picong": [
    "Doing jokes on a person in song. Most famous was the Melody / Sparrow picongs during the 50s.",
    "To insult in a jesting manner."
  ],
  "Pierott granade": ["Local clown-like carnival character."],
  "Pickers": ["Thorns."],
  "Ping Pong": [
    "The name first used for the steelpan. It derived its name from the sound that was made on the pans."
  ],
  "Pissin tail": ["A person of no class or importance."],
  "Planasse": ["To hit someone with the flat side of a cutlass."],
  "Playin social": [
    "Someone who pretends to be of a higher social strata than they are."
  ],
  "Plummer, Denyse": [
    "Trinidadian calypso sensation, also called \"The Queen of Calypso\". Two of her favered songs we took for our web site, \"Catharsis\" and \"Nah leaving\". We can recommend to buy her CDs. It's great music!."
  ],
  "Po po": ["Very small child, a baby."],
  "Pomme cythere": ["The fruit golden apple."],
  "Pong": [
    "Pound.",
    "Pound, to have sex with / pound e.g. 'Gih meh two pongs of tomatoes dey tantie.'."
  ],
  "Port of Spain": [
    "Capital city of The Republic of Trinidad and Tobago, located in NW Trinidad.",
    "Capitol city of Trinidad and Tobago, located in northwest Trinidad."
  ],
  "Pressure / Preshah": ["Intense circumstances, rough times."],
  "Prim prim": ["Disgustingly proper and formal."],
  "Quadrophone": ["Midrange instrument, as the name indicates a four pan set."],
  "Queen's Park Savannah": [
    "A large field in Port of Spain. The land was willed to the people of Trinbago by an English expatriate to be used for horse racing and other local events. During the colonial period it was used by the English colonial gentry of Trinbago. It is said that it was agreed in the will that nothing permanent should be built on the land. Its title 'Queen' is so named after the then reigning Queen of England."
  ],
  "Qualey": ["Withered, dried up.", "Withered, dried up."],
  "Quenk": ["An irritating person.", "An irritating person."],
  "Raff": [
    "To grab suddenly, to take away something from someone.",
    "To grab suddenly."
  ],
  "Ragadang": ["Broken down, derelict.", "Broken down."],
  "Ram cram": ["Packed to capacity."],
  "Rapso": [
    "A new type of music that merges Soca with American Hip Hop rap music."
  ],
  "Rat toungue does sell e head": [
    "Disclosing too much will get you into trouble."
  ],
  "Road march": [
    "Name of the tune of choice that is played the most times on the road for Carnival. Up until the 1970s the steelbands decided the winning road march."
  ],
  "Road March King": [
    "A Calypso composer whose tune has been adjugded the most popular (played) for that particular year's Carnival."
  ],
  "Rude": ["Nasty, sexually explicit.", "Nasty', sexually explicit."],
  "Rudder, David Michael": [
    "A Calypsonian who won three competitions in the same year: the Calypso Monarch, the road march and the young kings competition. Most notably is the fact that he never entered another competition after that spectacle feat. He now resides in Canada. His CDs are sold world wide. Great music!."
  ],
  "Rumfle": ["Ruffled or wrinkled.", "Ruffled or wrinkled."],
  "Rumshop": [
    "A local term for the shops that sold rum. The most famous rum shop was Vasco Da Gama that was situated at St. Joseph Road in Port of Spain."
  ],
  "Saga boy / girl": [
    "A male / female who is boastful of his or her physical attributes, flashy dresser, dandy."
  ],
  "Sailor band": [
    "A mas that was played by steelbands in the 60s where it was very popular."
  ],
  "Sampat": ["An unfair attack, out-numbered ambush."],
  "Savannah": ["Short for Queen's Park Savannah."],
  "Schupid, Chupid, Schupidness": ["Stupid."],
  "Schupidee, Chupidee": ["A stupid person."],
  "Screw pan": [
    "An angry or determined look on a persons face, usually humorous and ugly."
  ],
  "Shades": ["Sunglasses.", "Sunglasses."],
  "Shadow beni": [
    "Cilantro, a herb known for its distinctive seasoning flavour, used in cooking meats."
  ],
  "Shango": [
    "A religion (Yoruba) that is practiced by African descendants. It is a mixture of African religion and Catholism. During slavery the European slave masters forbade the enslaved Africans from practicing their religion so the enslaved Africans hid the practice of their religion from the Slave masters by disguising it and using Catholic symbols and language. Shango drummers also heat and burn the skins of their drums."
  ],
  "Sharpe, Lennox \"Boogsie\"": [
    "He is the founding arranger of Phase II Pan Groove Steel Orchestra. He was formerly a member of Starlift Steel Orchestra but left because he could express his arranging abilities since the resident arranger was Ray Holman. Boogsie left and form his own steelband, Phase II. He is a prolific arranger who uses jazz melodies in his music more than any other pan arranger. He has a dedicated following and is known for composing and arranging the winning tune of choice for the Skiffle Bunch Steel Orchestra at the 2000 World Steelband Music Festival, and the WSMF 2005 pieces for Skiffle Bunch Steel Orchestra who placed second in the competition."
  ],
  "Shif yuh carcass": ["Move over, get going."],
  "Shrims": ["Shrimps."],
  "Shub/Shove": ["Move or cast aside."],
  "Skin up yuh nose": [
    "To turn up ones nose at anything.",
    "To turn up one's nose at anything."
  ],
  "Skinnin yuh teet": ["Grinning."],
  "Sky-lark": ["To idle, waste time."],
  "Soca": [
    "A modern version of the Calypso. Most people agree that the late Ras Shorti I created Soca. Its beat is different than Calypso in that its beat is on the bass rather than the drum unlike Calypso. Over the years it has taken many turns as singers innovate with the sound.",
    "Soul-Calypso, the modern version of calypso music. Hardcore political satire, scandals, sexual double entendre and comedy, wrapped up in dance music with an African beat and heavy baseline."
  ],
  "Soca Warriors": [
    "Footballteam. Not just a team, but the heroes of  T&T, as they qualified for the World Cup 2006. Accompanied by a 150-piece cultural team (Soca Caravan) they brought a taste of Trinidad Carnival to Germany. They did not win the World Cup though, they won thousands of new friends, fans, and hearts the world over!."
  ],
  "Soucouyant, Sucuyant": [
    "Usually an old female vampire that sheds its human skin and flies at night as a ball of fire, sucking the blood of its victims."
  ],
  "Sparrow, Mighty": [
    "Mighty Sparrow is the greatest Calypsonian in the world. He hit the stage in 1956 with his Calypso Jean and Dinah to win the Calypso Monarch. He has won the Calypso Monarch more than any other Calypsonian to date. He was originally born in Grenada but moved with his parents to Trinbago when he was five or six years old. He is responsible for giving Calypso its artistic character. From 1963 to the 70s he had a Calypso rivalry with Kitchener, the Road March King. For many years the road march titles were divided between them."
  ],
  "Spit in de air it goh fall in yu face": [
    "The evil you do will come back to haunt you."
  ],
  "Steeldrum": [
    "A barrel for shipping/storage different kind of chemicals and food, available in different measurements. The 55 gallon drum that stores oil was used to create the first steelpans in Trinidad & Tobago."
  ],
  "Steelpan": [
    "A definite-pitch, acoustic, percussion instrument. It consists of a circular playing surface made from steel stretched into a concave shape and attached to a hollow, cylindrical resonator called a skirt. This surface is optimised into a number of isolated convex sections called notes. The instrument is usually played with hand-held, rubber-tipped, non-sonorous mallets called sticks (mallets). The steelpan is such a unique instrument that it cannot be definitively classified as either a membranophone or an idiophone. It is the only hybrid percussion instrument in existence today."
  ],
  "Suck eye": ["Too easy for words to describe."],
  "Swell up yuh face": ["To look angry, to pout.", "To look angry, to pout."],
  "Tamboo Bamboo": [
    "Tamboo bamboo bands were the first mas bands for Carnival days. They are bamboos cut to different lengths to get different sounds. This was a before the steelband."
  ],
  "Tantie, Tante": ["Aunt."],
  "Tassa Drum": [
    "A traditional east indian instrument. In order to raise the tone to an optimal pitch and to tighten the skin a tassa drum needs to be heated before one can play it. And then it's played with two sticks. Also a tassa group consists of the lead, the supporting and the bass drums as well as a pair of cymbals named Jhanji."
  ],
  "Tent, Kaiso tent": [
    "A calypso or soca concert featuring several singers, music bands and comedians."
  ],
  "Tick, Thick": ["Overweight as in 'She not real fat, he slim-tick'."],
  "Tight": ["Intoxicated, drunk, stoned.", "Intoxicated, drunk, stoned."],
  "Titty-vay, Titivate": ["To waste time or stir up trouble."],
  "TNT": [
    "Trinidad and Tobago.",
    "Trinidad and Tobago, twin island nation six miles off the coast of Venezuela, South America."
  ],
  "To besides": ["Besides which.", "Besides which."],
  "To throw watar on duck back": [
    "To waste your time, to make futile attempts."
  ],
  "Toh-ty, Toti, ToTo": ["The Male genitalia, penis."],
  "Too tool bay / Toutoulday": [
    "A confused state, in a daze, also head over heels in love, a gullible person, a fool."
  ],
  "Too-bay-go": ["Tobago.", "Trini pronunciation (Tobago)."],
  "Too-nee, poom-poom, scizzors": ["Female genitalia, vagina."],
  "Tot Tots": ["Female breasts."],
  "Trinbago": [
    "Short name for Trinidad and Tobago. In the 1970s some people believed that the name was too long. It was shortened to Trinbago. Today it is used by many people and even the local newspapers.",
    "Short for Trinidad and Tobago."
  ],
  "Trinity Hills": ["The three hills in Trinidad."],
  "TUCO": [
    "Trinbago Unified Calypsonians Organization. They aim to present, produce, manage, conduct, represent, enhance, research and, in all aspects advance the art of Calypso to the world through all available media and entertainment forms."
  ],
  "Tumba": ["Conga. The tumba man is the conga player; el conguero."],
  "Tuner": [
    "The person who does the pre-tuning, tempering / burning and the final tuning of the steel pan. We don't pick up HOW to make a pan in this ABC, since you can find that on hundred other websites. Anyway, best bet is to visit a tuner at work, we are quite sure that he will gladly show and explain you the procedere of his art work."
  ],
  "Two tounged": ["Deceitful."],
  "Umpteen": ["Plenty of anything, very often.", "Plenty of anything."],
  "Vampin": ["Producing a veryn offensive smell."],
  "Vaps": [
    "A suddenly behave excitedly or in a strange manner.",
    "To suddenly behave excitedly or in a strange manner."
  ],
  "Vikiey vi": ["Evasive, unreliable, indecisive."],
  "Wais": [
    "Waist.",
    "Trini pronunciation (Waist) The ability to wine 'De gyul only trowin ral good wais!'."
  ],
  "Warap": ["A very weak mixture.", "A very weak mixture."],
  "Well yes!": ["An expression of disbelief.", "An expression of disbelief."],
  "West Indian": [
    "A misnomer. Christopher Columbus believed he had discovered India and named the region West Indies but he was wrong. Hence, the term West Indian is used to describe someone from the West Indies. But, progressive people use Caribbean People."
  ],
  "Wet fowl": ["Sickly looking."],
  "Wha happenin dey?": ["What's happening?."],
  "Whappen?": [
    "What's the matter with you? or How are things?.",
    "What's the matter with you?."
  ],
  "What sweet in goat mout does sour in he bam bam": [
    "Fun today will cause problems in the future."
  ],
  "When cock geh teet": ["It will never happen; an impossible situation."],
  "Whey": ["Where.", "Where?."],
  "Whey yuh say?": ["What did you say?.", "What did you say?."],
  "Wine, Winin": [
    "A sexually suggestive dance using rthymic hip gyrations that can make the hula look tame, best done to calypso music. Wining is a gyrating motion made by Trinbago women. Its movements had erotic and sensual connotations but it is very innocent dancing. Foreign sometimes mistake wining for lose behavior. It is not. Men also wine."
  ],
  "Xylopan": [
    "With around 50 notes it may be the largest instrument in the pan family. Its creator is Jomo Wahtuse (1995), it is a soprano pan surrounded by eight satellite pans and meant to suit the Pan virtuoso."
  ],
  "You an all?": ["You too?."],
  "You so": ["People like you.", "People like you."],
  "Yuh makin joke!": ["You can't be serious."],
  "Yuh faddah head": [
    "An expression indicating disgust.",
    "An expression of annoyance."
  ],
  "Yuh faddah is a glassmaker?": [
    "You are blocking my view.",
    "You are blocking my view."
  ],
  "Yuh look fuh dat": ["It is your own fault.", "It's your own fault."],
  "Zug up": ["A rough and uneven cutting of anything."],
  "Angostura (bitters) (n)": [
    "A reddish-brown, slightly bitter, aromatic, alcohol-based liquid used to flavour drinks."
  ],
  "Back a jackass in ah horse race (phrase)": [
    "Back or bet on a loser one that should have been obvious had no chance to succeed."
  ],
  "Bad John (noun)": [
    "A man willing to use violence and who likes being known as a dangerous person; a ruffian."
  ],
  "Bokee": [
    "A penalty in children's games, usualy marbles, in which the winner snaps a finger or pitchess a marbles hard against the loser's fingers or knuckles."
  ],
  "Break Dew": [
    "Remain outside for a long time at night; stay outside all night until the morning DEW comes.\nYou break so much dew you catch cold."
  ],
  "Bring Belly": [
    "Become pregnant while living in the parental home.  You playing big woman, knocking all about at night, don't bring any belly here."
  ],
  "Broko foot": ["Having one leg shorter than the other, limping."],
  "Brulejol / buljol / bhuljol / bull-jowl / brulejol / bulljoll, buljug": [
    "A dish made from salt cod, oil, onions, tomatoes, peppers usually eaten for breakfast.  French origin brÛle 'burn' + geule 'throat'."
  ],
  "Buck (n)": [
    "An aboriginal Indian native of Guyana. A Guyana Amerindian locally generally refers to the Guarahoon tribe, living in Venezuela, and sometimes Guyana. (English buck 'a man, applied to native Indians of South America' probably Dutch bok 'he-goat') Warahoon."
  ],
  "Bus bamboo, burst bamboo (phr)": [
    "An activity usually of boys, traditionally done from Divali through Christmas. A small amount of pitch oil is poured into a section of cut bamboo, then the fumes are ignited. The resulting explosion sounds like a small canon."
  ],
  "Carnival Baby (n)": [
    "A child born about nine months after Carnival usually in November. (From being conceived during Carnival fever.\nThe acceptance of normally disapproved social practices such as the public consumption of alcohol and forms of sexual interaction also relate to this phenomenon, as gan warfare, no less than male/female relationships and the Carnival-baby syndrome, contribute to a societal detumescence even if for certain portions of the society more than others."
  ],
  "Catty-Catty (adj)": [
    "Said of a man who likes sex with many women.\nShe lend one brush to Lord Shorty, the catty catty one from South."
  ],
  "Cax for bokee": [
    "In marble PITCH, a game in which players place their marbles at random, each player then tries to hit another's marble, and the player whose marble is hit gets a BOKEE penalty."
  ],
  "Cax": ["The sound of a solid hit in marbles\nI hit him caxs!."],
  "Chickichong, chickeechong (n)": [
    "(Bird) A small songbird also known as a bullfinch or large red-bellied finch. The bird is about five inches long, mostly black with a brown belly and a short thick beak, its song 'a fairly long, musical series of clear whistled notes'.\n(Kite) In addition to the paper and wood kites, there are the all-paper kits, known as chickichong and the corbeau kites. They are made and flown mostly by elementary school-age children since all you need to make them is a piece of paper (usually the size of a school exercise-copy book) and thread. The kite is named after the bird because of its small stature."
  ],
  "Cobo, Cobeau": [
    "Corbeau or Coragyps atratus (Black Vulture), a large bird. A very common resident in Tridindada, not found in Tobago.   Corbeau is French for Raven."
  ],
  "Cockroach before fowl (phrase)": [
    "Temptation; something impossible to resist.\nDoh put that cake out, you put cockroach before fowl."
  ],
  "Cocktax": ["Court-ordered child support payments."],
  "Kokiyoko, Cokey-O-Ko (adv)": [
    "A cockcrow, describing the sound of a male fowl calling. Ewe kokolieko, Yoruba kekere-n-ke, Igbo kokorokoko, Lingala kokoliko, French coquerico, 'sound of a cock crow'."
  ],
  "Kokiyoko, Cokey-O-Ko (v)": [
    "Carry another person on one's back, usually done with children for fun, or to relive the child when it is tired. Northeastern Kikongo koka 'pick up and carry, e.g. scraps, leaves; kokila 'hold the arms around the neck of another."
  ],
  "Dance top in mud (phr)": [
    "Try something without chance of success; be frustrated by trying to do something in too difficult a situation."
  ],
  "Dhansirya": [
    "A woman who wastes money.  I sorry fuh he, that wife ah he one is ah dhansirya."
  ],
  "Dingolay (v)": [
    "Twists; turn; gyrate. (Kongo dyengula 'agitate the waist in dancing'and possibly."
  ],
  "Donkey years (phr)": [
    "A very long time. (donkey's years  ' a very long time>).\n'Les, when last.... 'Years man.' 'Is ah long time, oui.' 'A long, long time, donkey years.'."
  ],
  "Doudou, doodoo, doux-doux (n)": [
    "Sweetness; sweetie; a term of affectionate endearment, usually used to females."
  ],
  "Douen, Duende, Douaine, Doune, Dwen, Duegne (n)": [
    "A Folklore character, the spirit of a child who died before baptism.  Douens wear large hats, have backwards-pointing feet, utter a soft hooting cry, and often lead children to wander off."
  ],
  "Eat and wipe mouth like fowl (phr)": [
    "Do something wrong, but quickly cover up the evidence."
  ],
  "Fada, fadder, farder, father (n)": [
    "An intensifier usually positive, emphasising the large, grand, superlative, impressive, or exaggerated quality of something. Usually placed after the word it modifies."
  ],
  "Feel how (phr)": [
    "Feel peculiar, not normal, especially uncomfortable, ill at ease, upset over something.\n'Doh feel no how, ah go fix up yuh bicycle for you.'."
  ],
  "Ganga Channa": [
    "A magical practice to make a lover remain faithful; a woman squats over a bowl of hot CHANA, lets her sweat drip into it, and gives it to the man to eat. See also SWEAT RICE.  Ganga 'Ganges river; water + chana).  The correct term [is] sweat rice, but channa (chick peas [garbanzo] beans) are substituted for rice and Ganga refers to water, of whatever dubious origin.  This meal is served by a woman to the man that she wishes to cast a spell over. (Skettel.com 25 April 2001)."
  ],
  "Get On": [
    "Carry on loudly; talk in an angry or excited way.\nAny time you get ah real American in an aggravating situation, the first thing he do is let his voice be heard in objection; in other words, he does get on."
  ],
  "Goat-Mouth (n)": [
    "With, have or put....on, cause bad luck to befall someone or something by predicting or expressing a good outcome. (French belief that where goats eat, nothing grows.). A believed ability, possessed by some individuals, to deliberately frustrate somebody's effort or cause some minor misfortune by predicting failure. Also known as bouch-kabwit in Dominica, which means to have bad mouth.\nHis savings were diminishing and employment was not in sight. It seemed as though the Catholic priest has put goat-mouth on him.\nLawd, Rachel, don' set yu goat-mouth 'pon de people them; yuh always preaching crosses."
  ],
  "Gouti Look Back": [
    "A position for sexual intercourse in which the man is behind the woman who is usually on her hands and knees."
  ],
  "Gownay": ["Elope; run away to get married.  They gone to gownay."],
  "Guts like Cobo (phr)": [
    "With have, describing someone who can eat anything also someone who doesn't react badly to being insulted or getting pressure.\nHe doesn't get on, he have guts like cobo (1990)."
  ],
  "Half-Pick Duck, Harpic Duck (phr)": ["Not the whole story, explanation."],
  "Have cocoa in de sun (phrase)": [
    "Trinidadian phrase used as a warning that something is vulnerable, and needs to be protected; often used for situations in which people have something to hide.\nWhen yuh have cocoa in de sun, look out for rain!."
  ],
  "Horn (v)": [
    "Cuckold; commit adultery; have a sexual relationship outside of an official one.\nPlatform work demands at least the minding of one deputy, in case your wife is horning you while your're out there, drilling."
  ],
  "Huff (v)": [
    "Steal especially take before anyone else can take it.\nShe wanted to 'huff' the little money her ex-husband had and take it back to the USA with her."
  ],
  "If crab walk (phr)": [
    "A proverbial expression indicating that if you do not take some risks, you will not gain anything, but if you take too many risks, you may end up in trouble.\nIf crab don' walk, he no get fat, but if he walk too much he go de pot no?."
  ],
  "Jam-cram  (adj)": [
    "Crowded; packed usually with people. (English jam 'press, squeeze or crowd together in a compact mass; force together' + English cram 'fill to excess') = ram-cram, ram-jam.\nEverybody was jam-cram in the North Stand."
  ],
  "Jorts, jhorts, draughts  (n)": [
    "Food, especially snacks or refreshments.\nIf you see, endless jorts.\nRight in front of his place, he has the big lawn tennis court where prospective clients or investors could talk it over....cuffing down their liquor and small jorts."
  ],
  "Jouvert, Jour ouvert, Jouvert (n)": [
    "The official beginning of Carnival at daybreak on the Monday preceding Ash Wednesday."
  ],
  "Kakanade": ["Gossip; idle talk, shit talk."],
  "Kakalaylay  (n)": [
    "Sexually suggestive dancing. /kakalele/ (<kaka + lele dance>)."
  ],
  "Kaka-nay (n)": ["Dirty nose; snotty nose."],
  "Kick Pan": [
    "A children's game in which a metal container is placed in the centre of the playing area; a catcher searches, while players to sneak in and kick if over before being caught.\nThe children playing kick the can down the road."
  ],
  "Kicksing (n)": [
    "Not taking things seriously; fooling around and not working."
  ],
  "Koté-si Koté-la, coté-ci coté-la (phr)": [
    "Gossip usually of the amusing kind or [used as an adjunct] And so on and so forth; etcetera.\nLook I ain['t] wan[t] to be in dis coté-ci coté-la, yo[u] see! All dis dem sa[y] he sa[y] ain'[t] fo[r] me."
  ],
  "Kunumunu, coonoomoonoo,cunumunu (n)": [
    "A fool; simpleton; someone easily deceived or taken advantage of. /kunumunu/  (possibly Yoruba kunun, kunu 'shy; no self-confident'; possibly Hindi and/or Bhojpuri cunuh munuh 'little baby'.\nFrom the day you give the callaloo, You had me just like your kunumunu. (Growler 'I Don't want no Calaloo' 1939)."
  ],
  "Kuyoh (n)": [
    "Fool; someone easily decived; under someone's power. /kuyo/ Spanish cuna or French couillon 'fool; imbecile'.\nHis wife horning him, she have him so kuyoh, he only washing wares."
  ],
  "Lacuray, la couray (n)": [
    "A strained or difficult relationship or situation /lakure/ from French and French Creole la querelle 'the quarrel'."
  ],
  "Lajablesse, La Jabless, La Diablesse (n)": [
    "A folklore character, a beautiful woman in a long dress who has one foot like a cow's; she entices men astray at night in the forest or on lonely roads.  < French la 'the' + diablesse 'female devil'>\n[The] diabless....is a she-devil, one of whose foot end in a cloven hoof, who frequents cemeteries and crossroads....she is particularly fond of attending belle air dances, and after the festivities, young males would make advanced to her and she would encourage her victim to follow her home....then as she leads him to a precipice she would suddenly transform herself into a huge hog....If however, the young swain knows the ropes he would pick two sticks and make a cross at which time she would also disappear."
  ],
  "Lick Out": [
    "Devastate; destroy; damaged; take away; wear out; use up; spend money without restraints, recklessly\nThe school fees lick out my money."
  ],
  "Light Candle (phr)": [
    "Perform an OBEAH ritual involving the lighting of a candle, in order to do harm to someone = put light.\nIf I cannot get justice from the law of this land, I will even light candle."
  ],
  "Lime": [
    "Participate in an informal gathering of two or more people, characterised by semi-ritualised talking and socialising, drinking and eating.  In the day when you miss me, Ah liming by some old lady.",
    "To hang out in a casual atmosphere, loafing e.g. 'I feeling to lime.'."
  ],
  "Loup Garou, Lugahu (n)": [
    "In folklore, a human who takes the form of an animal, generally, at night. loup garou 'werewolf'>.\nThe man who stole the chickens and was acquitted is really ah loup garou."
  ],
  "Maharajin, marajhin, marajin (n)": [
    "A term of address or reference for the wife of a Brahmin or Pundit. Generally used as a term of respectful address for any married woman."
  ],
  "Maljo, maljoe, maljeu (n)": [
    "Evil eye; the belief that a conscious or unconscious look of envy or ill will can harm someone.  <French Creole malzie, Spanish  mal de ojo 'evil eye'; Yoruba fi oju buruku si 'put ugly eye on, Igbo /ole anja 'look ugly  eye', Kikongo /ntadidi je disu/ 'look with bad eye'\nI heard them say how my donkey grows, It seems like they want to give it maljo.... The whole this is through jealousy , Because they want to buy me donkey from me.\nA disease, attributed to maljo, characterized by fever, changed colour, inability to urinate, loss of appetite and weight, greenish stool."
  ],
  "Mama Glo, Mama Dlo, Mama D'Leau (n)": [
    "A folklore character in the form of a beautiful woman, sometimes snake-like, with long hair and a fish-like tail who lives in rivers."
  ],
  "Massa Day Done": [
    "An expression used to reproach someone to remind them that colonial days are finished and old privileges and oppression are no longer acceptable. (Public lecture by Eric Williams, 22 March 1961)."
  ],
  "Matta Fix": [
    "Settled; arranged; ready to go.\nA good brulejol must never boil, Once it's well mixed, is matta fixed."
  ],
  "Mauvay Langue, mauvaise langue (n)": [
    "Critical, slanderous talk. (French mauvaise 'bad' + langue 'tongue').  A person who says malicious, gossipy or slanderous things.\nI find both appalling and disgusting..the pettiness that sees a sinister plot behind every move the brand new government makes.  The mauvais langue, vicious and calculated to damage reputation and character."
  ],
  "Never-see-come-see  (n)": [
    "Of a person, unsophisticated and therefore excited about something ordinary."
  ],
  "Obzocky, obsockie, obzokee, obsukky, obzoky, obzockie, upzuckie  (adj)": [
    "Unbalanced; awkward-looking; of ungraceful line or shape; of a batsman, not flowing or smooth."
  ],
  "Orisha (n)": [
    "An African religion, mostly of Yoruba origin, known also as SHANGO, based on the worship of numerous ORISHA (deities), who also have Catholic counterparts. Worship includes spirit possession, drumming, dancing, chanting, and animal sacrifice. Severely represses at times during the past, it has survived, and is no more openly accepted."
  ],
  "Pail Closet": [
    "An outside latrine; an enclosed toilet consisting of a pail (bucket) underneath a seat with an opening in it."
  ],
  "Papa Bois (n)": [
    "A folklore character, usually depicted as having a man's head, chest and arms, with goat-horns on the head, and the lower body of a goat or similar animal. He is the protector of animals in the forests and can change himself into animal forms to lead hunters away."
  ],
  "Parang (n)": [
    "A traditional Venezuelan-derived type of singing, sometimes improvisational, on religious themes, usually entirely in Spanish, performed around Christmas, in house-to-house carolling or while visiting friends. (Spanish parranda 'serenading; going out and singing; having a good time')\nI myself buy rum for when the neighbours come over, and when the parang pass playing the quatros and signing the seranales for Christmas."
  ],
  "Pasray, pasare (v)": [
    "Spread; stretch, e.g. a sheet; sprawl, sit in a vulgar, exposed way, usually said of a woman. /pasre, pasare/  (Hindi and/or Bhojpuri pasarna 'spread out; stretch out)\nLook how she pasreyin sheself dey.   She pasare like ah mad oman."
  ],
  "Phantom (n)": [
    "A folklore character; a very tall, misty white figure who stands at crossroads, and traps those who pass between his legs."
  ],
  "Pull hand": [
    "In SUSU, to collect the entire amount of all members contributions in your turn."
  ],
  "Quelbe, quelba, quilbay 1 (n)": [
    "A kind of African dance possibly of Congo origin, comprising songs, drumming and dances performed by women.\nAs late as 1940 on the hills in Charlotteville at nights one could hear the music of Congo women playing what villagers called Congo-drum (marli doun-doun) and tambour-bamboo....and dancing quelbe reputed to be a very wild erotic dance for females only."
  ],
  "Quito-Quito (n)": [
    "A distant place in the countryside. Very far away from town life or from any important or well-known place."
  ],
  "Rachifee, ratcheefi, ratchifi, rachify (n)": [
    "Somethings done in a makeshift, careless, or slightly devious way; or as a result of cheating, corruptions, or trickery."
  ],
  "Ram Goat Can't Pee": [
    "Phrase indicating that you do not believe someone's story.  He cleaned up the whole house? That ram goat can't pee!."
  ],
  "Reds (n)": [
    "A formal form of address for a RED-SKIN person usually friendly. Hey reds, leh we take a drive up Maracas nuh?."
  ],
  "Red-Skin (adj)": [
    "Light-coloured in complexion, brown, light brown, reddish-brown or reddish-white; usually a mixture of European (White) and Africans (Black).Anyway, buxom, brown-skinned Cecilia and her red-skinned daughter, Barbara, were in trouble today."
  ],
  "Rings": [
    "In PITCH, a small circle, usually about 18 inches in diameter, in which the marbles are placed; the object is to now opponents' marbles out of this ring with your TAW."
  ],
  "Rings & Taws (Right Through)": [
    "In PITCH, shouted before pitching in RINGS, when you intend to roll your marble through the field of play and keep anything you hit out of the ring, including your opponents TAW, and in addition claim points for any opponent's marbles which have been indirectly hit.\nI going to pitch, rings and taws!."
  ],
  "Rum Jumbie (n)": ["Habitual drunkard; alcoholic."],
  "Rum Talk (n)": [
    "Saying or promising things when drunk that you would not do if sober."
  ],
  "Sancoch, sancoche, sancoach, sancocho, san kootch (n)": [
    "A thick soup made with meat, GROUND PROVISIONS, and vegetables."
  ],
  "Sandimanitay, sans humanité, sandemanetay, santimanitay (n)": [
    "A traditional Kalinda and Calypso challenge refrain. (French sans humanité 'without mercy').\nNone of the bands sang any properly composed songs, most of t the songs having a jingle of words uttered with lightning-like rapidity and ending with the monotonous sans humanité."
  ],
  "Say Prunes (Phr)": [
    "Used often with a negative to describe someone who seems to be quite but turns out to be quite the opposite."
  ],
  "Soucouyant (n)": [
    "A person, usually an old woman, who sheds her skin, travels as a ball of fire and sucks people's blood, leaving a blue mark. Soucouyans, have an unnatural and indelicate propensity for casting off their skin, which they usually conceal in or under a chocolate mortar."
  ],
  "Sprawl Off (v)": [
    "Sprawl; lie around in a relaxed manner with limbs spread out."
  ],
  "SUSU": [
    "A cooperative savings systems in which each person contributes the same fixed amount each week, and the whole amount, the HAND is taken by a different member each time."
  ],
  "Sweat Rice": [
    "Rice into which a woman, given to a man to make him remain faithful.  Steam rice. 'Sweat rice' was supposed to be one of the more potent aphrodisiacs employed to 'tie' men. A meal of rice, which a woman prepares when she wants to trap a man.  The woman prepares this by squatting over steaming rice, and allowing her vaginal  juices to 'sweat into the rice.'."
  ],
  "Tabanca, tabanka, tabankca, tobanca (n)": [
    "A painful feeling of unrequited love, from loving someone who does not love in return, especially someone who was once a lover or spouse."
  ],
  "Tanka Lanka (phr)": [
    "Expression meaning 'you're going to get in trouble', used by schoolchildren, usually accompanied by shaking of one hand."
  ],
  "Tobago ice-water (n)": [
    "A humorous reference to sucking a dinner mint and drinking pipe water afterwards to give a cold water effect when ice is not available.  From denigration of living conditions from the view of a less sophisticated Tobago.\nYuh have to take Tobago ice-water, to wash down that doubles boi."
  ],
  "Tobago love (n)": [
    "Said of a relationship characterized by lack of demonstration of affection, or by fighting."
  ],
  "Tonnere, tonnay, tonnier (intj)": [
    "Exclamation of suprise, vexations, annoyance. (tonnere 'thunder', an expression of anger)\nTonnerre! It have plenty people in this fete."
  ],
  "Tout Bagai, toot bagai,  tout bagaille (pron)": [
    "Everything; all sorts of things. /tut bagai/ (tout 'all' + bagai 'thing')."
  ],
  "Tringlish (n)": [
    "A humorous name for the local vernacular, considered as a variety or dialect of English, or as an English-related creole language."
  ],
  "Turtle Botheration": [
    "A preparation of a  turtle penis in rum, of which small sips are taken as a male aphrodisiac."
  ],
  "Washikong, wachekong, washeekong, watchekong, watchi-kong (n)": [
    "Rubber-soled canvas shoes; sneakers; plimsolls; running shoes."
  ],
  "Waving Gallery (n)": [
    "An area of the former airport building at Piarco Trinidad, where people waiting for arriving passengers could see and wave to them as they came in.\nWe stand up in the waving gallery and watch you pulling your bag, I could imagine how your hand feeling."
  ],
  "Whey de arse (phr)": [
    "An expression of disgust, disapproval.\nBu' wey de arse is dat? Sinc when you become church defender?."
  ],
  "Wild Meat (n)": [
    "Game; meat from animals killed by hunting, most commonly DEER, QUENK, MANICOU, TATU, GOUTI and LAP."
  ],
  "Vai-ki-vai, vaille—que–vaille, vai-qui-vai, vie-que-vie, vike-e-vike,vi-ke-vi, vikey–vy, vy-kee-vy, vy-ki-vy (adj)": [
    "Lackadaisical; disorderly; unplanned;chaotic; irresponsible; without care or thought. French Creole vai ki vai; French vaille que vaille 'for better or worse'\nI live the carefree now-for-now, Worship the nine-day- wonder, I have no future plans or hopes, No scruples to live under."
  ],
  "Xamboula (n)": [
    "A type of African dance.\nXamboula dance is known by only a few persons. It is such an obscene dance that it is only [performed] by moonlings in the bush.  It comes from Trinidad."
  ],
  "Accra": ["(Ah Crh)&nbsp;A fried batter of salt fish &amp; Flour."],
  "Ah Chut": ["Shut up or Hush!."],
  "All Fours": [
    "Real Friggin good card game that was originated in Trinidad &amp; Tobago. click here to learn how to play!."
  ],
  "Allyuh or Alla-All-Yah": ["All of you people. A group."],
  "Aloo Pie": ["Fried Potato Pie."],
  "Aye": ["Hello."],
  "Aye-yah-yie": ["An expression of anticipation or pain, etc."],
  "Babash": [
    "Home made, illegal, alcoholic beverage (mountain dew, moonshine) which in Trinidad can be made of just about anything organic."
  ],
  "Back Back": [
    "A suggestive dance performed with the male dancer's front rubbing against the female's rear, and vice versa."
  ],
  "Back Pay": [
    "Money owing to union workers that they have been negotiating for a very long time."
  ],
  "Bad eye (cut-eye)": [
    "A look of anger, especially when looking from the corner of the eye."
  ],
  "Ba-John": ["A bully or a really tough customer."],
  "Bam bam": [
    "Also Boom-boom, boomsie, bamsie, bam-a-lam, background, backside, behind, ass, bottom / butt."
  ],
  "Bamsee": ["The rear end, what you sit on."],
  "Bamsee-hole": ["Ass hole."],
  "Bam-se Lambe": ["Rather attractive bamsee."],
  "Band": [
    "A group of Carnival masqueraders with costumes designed on a related theme. A band can have 4,000-7,000 people divided into 25 or more sections, each with it's own theme and several music trucks. Each band has a huge King and Queen costume. Carnival Tuesday will see about 20 large bands go across the savannah stage and parade in the streets in competition."
  ],
  "Bath suit": ["Swim suit."],
  "Battin": [
    "The act of throwing back one's head while holding a drink at one's mouth so as to finish it in a single attempt."
  ],
  "Bawlin' (Bawling)": ["To cry, yell or howl."],
  "Biscuit": ["Cookie, cracker."],
  "Bitin'meh style": ["Followin' the same thing (style) as one's person."],
  "Beppin": [
    "He art of puking the ten dollar tequila shots (that went down real good) and our brains at the same time, outside of Nuts or in Pelos Bathroom. OR To fall asleep while traveling OR The action of hitting the glass, seat or person next to your during sleep while travelling."
  ],
  "Bobolize": ["To bully someone."],
  "Boll'face": ["A pushy person, unreasonably demanding."],
  "Bonafide": ["Somone's Steady Girl/Boyfriend."],
  "Boof/buff": ["To insult, yell at or argue with someone."],
  "Brace": [
    "Denied entry to a party/fete OR a girl/boy blanking a boy/girl OR prepare oneself for a bad news."
  ],
  "Broughtupsy": [
    "Showing that a person was properly brought up.",
    "Showing that a person was properly brought up, decorum."
  ],
  "Buh aye aye": ["But wait a minute, now hold on/it."],
  "Buller or bullerman": ["Another word for a faggit or a gay man/homosexual."],
  "Buss it": ["To leave e.g. 'Well when I see dat, I buss it!'."],
  "Cahneevaal": [
    "(Carnival) 'Farewell to the Flesh' A pre-Lenten festival started by Catholics to get in one last party before giving up wine, women and song for 40 days during Lent. Preparations and partying in Trinidad start in January and build up to Jouvay (Monday) and Mardi Gras (Fat Tuesday) ending at midnite just before Ash Wednesday in mid-February. Costume bands in street Carnival, steelband competitions, Calypso contests, parties, dances and Kiddie Carnival all come together for Carnival. Rio and New Orleans carnivals are bigger and better known, Trinidad's is best."
  ],
  "Cheups (Steups)": ["A noise made by sucking your teeth."],
  "Chinkee": ["Very tiny portions of anything."],
  "Chips": ["French Fries e.g. 'May I have some chips, please?'."],
  "Chookaloonks": ["Pet name of your special someone."],
  "Coast or Coasting": ["To show off something or someone."],
  "Cockstand": ["Erected Penis."],
  "Cokee-eye/coki-eye": ["Cross-eyed or cocked eye."],
  "Commess(e)": ["Confusion associated with arguments, gossip and slander."],
  "Coonoomoonoo": ["(Cunumunu) Idiot, stupid person."],
  "Cosquel": ["Tacky looking."],
  "Cosquelita": ["A girl with excessive makeup."],
  "Crapo": [
    "(Crapaud) Frog The most detested reptile on the island. Often poisonous, they are hated worse than snakes."
  ],
  "Cyah/Cyaa": ["Can't."],
  "Da is you?": ["Is that you?."],
  "Dat good for yuh": ["Serves you right."],
  "Day": [
    "(Dey) Trini pronunciation of They and There. 'Ah hyar dey living dong by dey so.' (I heard they're living down there). You may have heard the old Calypso; 'Hush your mouth, go away, Mama look a Boo Boo dey!' (there)."
  ],
  "Dimarsh Gra": [
    "(Dimarche Gras) The major show on Carnival Sunday night. Eight King and eight Queen of the bands costumes (some 30 feet tall) compete on stage at Queen's Park Savannah to be named King and Queen of Carnival. The eight top singers compete to be crowned the Calypso Monarch."
  ],
  "Doh/Dough": ["Don't."],
  "Doo doo": [
    "(Doux doux) Sweetheart often used with darling, as in 'do do dahlin'."
  ],
  "Dred": [
    "Friend (see also hoss, padna); cool e.g. 'Dat movie was dred, eh dred?'."
  ],
  "Drevait (dree-vay)": ["Wayward person who likes to 'knock about'."],
  "Eh Easy": ["Not easy, difficult."],
  "Eh-eh": ["No, no way, oh no."],
  "Eh-heh": ["Oh really? I understand. Yes."],
  "End up": ["How something like a situation finished or turned out."],
  "En'less": ["Plenty, endless."],
  "Extempo": ["Free style singing of extemporaneous calypso songs."],
  "Fella": ["A fellow, a boy, a guy e.g. 'Way! Check dat fella!'."],
  "Fete": [
    "A party, loud music, lots to eat and drink, dancing to wee hours of the morning."
  ],
  "Founkie (foong-key)": ["Foul-smelling, stink odour."],
  "Fuh real?": [
    "Really? Is that so? e.g You fuh real Dred? (Are you serious?)."
  ],
  "Fuh true/troot?": ["Yes that is true. Is that really so?."],
  "Goin'orf": [
    "Someone who appears to be going out of their mind,acting strangely."
  ],
  "Gun talk": ["Fighting words, to threaten verbally."],
  "Geed/Gyad!": [
    "Expression of disgust when in the presence of something nasty. e.g OH GEED ot OH GYAD."
  ],
  "Hair she": [
    "(Hear she) Also Hair he I'm quoting her (him) as in 'I ask she 'But why you late?' Hair she, 'You is meh mudder?' '."
  ],
  "Harden": ["Disobedient."],
  "Hole it Dong (Hold it down)": ["To announce to someone to take care."],
  "Hototo or hotoetoe": ["A very large amount of anything."],
  "Hoggish": ["Rude, crude, mean; the behavior of a thug, gangster."],
  "Horner man/woman": [
    "The man/ woman your significant other is horning you with."
  ],
  "Hoss": ["A close friend e.g Wah happen Hoss? (How are are you my friend?)."],
  "Huh?": ["What?."],
  "Icenin'": ["Icing on a cake."],
  "I eh payin' tax fuh mih mout'": ["I could say anything I want."],
  "In ting": ["To be involved in current activity."],
  "In Trut (In truth)": [
    "For real, no lie e.g. 'That test was so hard!' Reply: 'In truth!'."
  ],
  "Is so?": ["Is that so?."],
  "Iron Pot": [
    "Pot made out of iron - famous for making pelau, stews and curry&nbsp; meats - seen at homes and river limes."
  ],
  "Izatrini": [
    "(I am/is a Trinibagonian) To profess ones nationality (Trinidadian or Tobagonian) proudly and without reservation."
  ],
  "Jeez-an-ages": ["Used for any reason where an outburst is appropriate."],
  "Joo-vay": [
    "(Jouvay, Jour Ouvert, J'Ouvert) 'Opening of Day' in French, Carnival Mas beginning before dawn on Carnival Monday wearing costumes of mud, old clothes (Ole Mas), devil costumes or satirical themes."
  ],
  "Jus'now": ["In a little while."],
  "Jus'so?": ["Just like that?."],
  "Jus'so": ["Out of the blue, totally unexpected."],
  "Ja`litre": ["2 litres of any soft drink / Soda."],
  "Ketch": ["Catch."],
  "Klim": ["Any brand of powdered milk but all everyone calls any brand Klim."],
  "Kewl": ["Cool."],
  "Las' Lap (Last Lap)": [
    "Last minute street partying on Carnival Tuesday which goes until midnite when Ash Wednesday begins. The very last of Carnival."
  ],
  "Leave": [
    "Trini syntax Left 'Me eh see she again, she leave de fete long time!'."
  ],
  "Lef dat": ["Leave that."],
  "Leh": ["Let, let's."],
  "Leh go": ["Let go."],
  "Leh we": ["Let us."],
  "Lick dong": ["To accidentally hit someone or something."],
  "Like t'ing": ["To be somewhat mischievous."],
  "Lil'bit": ["In small meaningless portions."],
  "Long eye": ["A person who is envious of the possessions of others."],
  "Look nuh!": ["An expression of annoyance."],
  "Macco": [
    "A person who minds other people's business for the purpose of gossip.&nbsp; e.g. 'Wha yuh macoing so for?'."
  ],
  "Macco Meter": [
    "Check the degree to which a person mind other people's business."
  ],
  "Maccocious": ["A person having the trait of a maco."],
  "Make Style": [
    "Show off as in 'Eh-eh, but I find she only makin' style on people!'."
  ],
  "Maga": ["Very thin, skinny."],
  "Mampie": ["A Fat Woman."],
  "Maracas Bay": [
    "The most beautiful beach in Trinidad, high waves, great scenery."
  ],
  "Mass": [
    "(Mas) Carnival costumes, or playing mas, street revelry in carnival costume."
  ],
  "Meh (My)": ["Gi' me de ting when you come to meh house, pahtnah.'."],
  "Mih han' slip": [
    "An expression used when too much of an ingredient is used."
  ],
  "Mo-Vay-Lang": [
    "French for 'Bad tongue' (Mauvais Langue) To bad talk someone, or engage in nasty gossip."
  ],
  "Moco Jumbie": [
    "Stilt dancers, an African tradition carried over to Trini carnival Their costumes represent jumbies, or spirits, of African mythology, in Haiti the word jumbie was corrupted to zombie."
  ],
  "Muddah": ["Mother."],
  "Mout'er": ["A boaster."],
  "Nowherian": ["A person who does not have any fixed place of abode."],
  "Obeah": ["Black magic, voodoo."],
  "OH gosh!": ["Oh gorm man!-Oh shimps man!."],
  "Ooooohh Koosh!": [
    "These are all expressions denoting shock, surprise,indignation and admiration."
  ],
  "Ol' talk": ["Idle chatter, social chit-chat."],
  "Oui": ["Yes e.g. It making hot oui!."],
  "Own-way": ["Stubborn person."],
  "One time": [
    "Right now, immediately e.g. 'De gyul was rel angry so I buss it one time.'."
  ],
  "Pan": [
    "Steel band, invented in Trinidad in the 1930's, melodic percussion instruments made out of oil drums. One hundred piece steel orchestras compete playing classical, soca, pop during Carnival."
  ],
  "Pahtnah": [
    "(Partner, Padna) Trini for 'homeboy' used by older Trini males."
  ],
  "Palance": [
    "/n1. palancing (verb) - to wander in pursuit of a lime. /n2. palancing (verb) - general term refers to the action of aimlessly wandering anywhere/n3. palancing (noun) - name of popular song by Jason Williams and Blaze in the Trinidad."
  ],
  "Papa yooo!": ["Exclamation of surprise."],
  "Patois": ["Local dialect."],
  "Picker": ["Thorns e.g. 'Doh touch dat rose bush. It have rel pickers.'."],
  "Pissin' tail": ["A person of no class or importance."],
  "Plann-asse": [
    "To hit someone continuously with the flat part of a cutlass."
  ],
  "Playin' social": [
    "Someone who pretends to be of a higher social strata than they are."
  ],
  "Poohar": ["See dotish."],
  "Po-po": ["Very small child, baby."],
  "Pot hound / pot hong": [
    "A mixed dog; sometimes used as an insult e.g. yuh lazy pothound!."
  ],
  "Prim-prim": ["Disgustingly proper and formal."],
  "Punannie": ["A sweeet vagina."],
  "Raise": ["A gift of cash to a friend or relative."],
  "Ram-cram": ["Packed to capacity."],
  "Reds": ["A light skinned person of mixed or African descent."],
  "Rel": ["Trini pronunciation Real."],
  "Road March": [
    "Kind of Trinidad's song of the year, or best song of Carnival. As the costume bands cross the stage in the Queen's Park Savannah, the song that most bands dance to is declared Road March for the year, and wins a large cash prize."
  ],
  "Saga boy/girl": ["Flashy dresser, dandy."],
  "Shif' yuh carcass": ["Move over, get going."],
  "Shub": ["Shove, move or cast aside."],
  "Schupid": ["Trini pronunciation (Chupid) Stupid also Schupidness."],
  "Schupidee": ["(Chupidee) Stupid person."],
  "Screw up yuh face": [
    "To make a strange expression, usually when angry or in disagreement of something e.g. 'Look how she screwin up she face nah!'."
  ],
  "Shots": ["Licks."],
  "Shyyt": ["This is how de ole people used to say shit."],
  "Soucouyant": [
    "From old ghost stories, an old woman who turns herself into a ball of fire and suck's people's blood."
  ],
  "Stickin'": [
    "When a person or group keeps back progress on something important. eg. Man u real stickin , hurry up !."
  ],
  "Skinnin' yuh teet'": ["Grinning."],
  "Strims": ["Shrimps."],
  "Sweet too bad": [
    "Really nice, pleasant, attractive e.g. 'Dred, dat gyul eh play she sweet too bad!'."
  ],
  "Sweet drink": ["Term used for soft drink, soda, pop."],
  "Sweee-drink": [
    "Soft drink/soda or a gesture nickname like babes or darling."
  ],
  "Tanty/Tanti (Tante)": ["Aunt."],
  "Tent": [
    "A calypso or soca concert featuring 20 singers and comedians. Started in the 1800's in large military tents, now held in concert halls or stadiums."
  ],
  "The sun makin' hott": ["The atmosphere is hot."],
  "Tick": [
    "Trini pronunciation (Thick) Overweight as in 'He not ral fat, he slim-tick!'."
  ],
  "Titty-vay": ["(Titivate) To waste time or stir up trouble."],
  "T'ing": ["Thing."],
  "Too-nee": [
    "(tuni) Female genitalia, also poom-poom, tun tun, powder puff, scizzors and nan."
  ],
  "Too-tool-bay": ["A confused state,in a daze, also head over heels in love."],
  "Toe-Tee": ["Male genitals."],
  "Tong": ["Town e.g. 'I went to tong today.' or Thong - Ladies underware."],
  "Tot tots": ["Female breasts."],
  "Toh-ty": ["(Toti) Also ToTo Male genitalia."],
  "Tree-nee": ["Trini pronunciation (Trini) anything or anyone Trinidadian."],
  "Tree-nee-daad": ["Trini pronunciation (Trinidad)."],
  "True": [
    "Trini pronunciation (Through). A common query from a sales clerk is 'Are you getting true?', meaning, 'Are you getting through' (finding what you want)."
  ],
  "T.T": [
    "Trinidad currency, as in 'Does this cost $5.00 T.T. or $5.00 U.S.?'."
  ],
  "Vampin'": ["An offensive smell."],
  "Vibes it Up": ["To keep in good spirits."],
  "Wah is de sceens?": ["Whats up?."],
  "Wee": [
    "From the French (Oui) Yes, as in 'Eh eh, dat is ral good buss up shut, oui?'."
  ],
  "Wha-happenin' dey?": ["What's happening."],
  "Whas de scene?": ["What's up? e.g. Ay padna, whas de scene?."],
  "Whole": ["All, as in 'We been limin' whole day!'."],
  "Wine/Wining": [
    "The style of dancing to Soca, Calypso and Chutney, circular movement of the waist or Trini term for rolling your waist line- looks very sexual."
  ],
  "Yang-Key": ["Trini pronunciation (Yankee) An American."],
  "You an' all?": ["You too?."],
  "Yuh makin' joke!": ["You can't be serious!."],
  "Zug-up": ["A rough and uneven cutting of anything."]
}
